      *---------------------------------------------------------------*
      *    Standard f�r alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DPAT0022.CPY  $
      *    $Revision:   1.0  $
      *
      *    $Log:   L:/MF/CPY/DPAT0022.CPv  $
      *
      *   Rev 1.0   Nov 04 1995 08:15:00   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      ***************************************************************** 00010001
      *    COPY-MEMBER: DPAT0022       TRACE-KURZ                     * 00020001
      *    --------------------------------------------------------   * 00030001
      *    VERSION   001                                              * 00040001
      *    --------------------------------------------------------   * 00050001
      *    ERSTELLT: W. SCH™LLHAMMER (INTEGRATA AG)                   * 00060001
      *    DATUM:    03.04.1993                                       * 00070001
      *    STAND:    15.04.1993                                       * 00080002
      ***************************************************************** 00090001
      *                                                                 00100001
      *------------------------------------------------------------*    20330000
      * ZR1-TRACE-KURZ                                             *    20340000
      *------------------------------------------------------------*    20350000
      * INPUT : ERR-ORT-SEC, ERR-TRACE,                            *    20360000
      *         CARU-S-TRACELEN                                    *    20370000
      *                                                            *    20380000
      * OUTPUT: ERR-TRACE                                          *    20390000
      *                                                            *    20400000
      * VERARBEITUNG:                                              *    20410000
      *   - AUFRUF VON UR2-TRACE, FALLS TRACELEN-LANG GESETZT IST  *    20420000
      *                                                            *    20430000
      *------------------------------------------------------------*    20440000
       ZR1-TRACE-KURZ SECTION.                                          20450000
       ZR1-ANF.                                                         20460000
      *                                                                 20470000
           IF TRACELEN-LANG IN C-COMMAREA                               20480002
              PERFORM UR2-TRACE                                         20490000
           END-IF                                                       20500000
           .                                                            20510000
       ZR1-EXIT.                                                        20520000
           EXIT.                                                        20530000
      *                                                                 20540001
      ******** ENDE COPY-MEMBER  TRACE-KURZ            (DRAT0022) ***** 20670001
