      *---------------------------------------------------------------*
      *    Standard f�r alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRAT0032.CPY  $
      *    $Revision:   1.0  $
      *
      *    $Log:   L:/MF/CPY/DRAT0032.CPv  $
      *
      *   Rev 1.0   Nov 04 1995 08:39:56   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      ***************************************************************** 00001000
      *    COPY-MEMBER: AUFRUFPARAMETER UPAT0001  (DRAT0032)          * 00002100
      *    --------------------------------------------------------   * 00003000
      *    ERSTELLT: W. SCHOELLHAMMER (INTEGRATA AG)                  * 00004100
      *    DATUM:    25.03.1993                                       * 00004200
      ***************************************************************** 00006000
      *    VERSION   1    01.10.94 08:16:52
      ****************************************************************  00008000
      * AENDERUNGEN:                                                 *  00009000
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *  00009100
      * -------------------------------------------------------------*  00009200
      *         !13.04.93! 01 ! NEU                       ! SCHOELLH.*  00009300
      * FEVB0156!27.09.94!    ! AKT-DATUM RAUSGENOMMEN    ! SCHOELLH.*  00010000
      *         !28.09.94! 02 ! PROD.šBERGABE             ! SCH™LLH. *  00010101
      *         !        !    !                           !          *  00010200
      *         !        !    !                           !          *  00010300
      *         !        !    !                           !          *  00010400
      *                                                              *  00010500
      * ENDE-LOGBUCH                                                 *  00010600
      ****************************************************************  00010700
      *                                                                 00100000
      *    AUFRUF-PARAMETER FUER UPRO UPAT0001 (AUFBEREITEN ERROR-BER.) 00110000
      *                                                                 00120000
      *    EINGABE UPAT0001: ERR-ERROR-BEREICH (DRAT0004)               00130000
      *                                                                 00190000
       01  PO-UPAT0001-AUSGABE.                                         00340000
           05  PO-UPAT0001-D-ERROR-BER         PIC  X(1920).            00350000
230994* 01  FILLER REDEFINES PO-UPAT0001-AUSGABE.                       00350200
230994*     05  FILLER                          PIC  X(0072).           00351000
230994*     05  PO-UPAT0001-D-AKT-DATUM         PIC  X(0008).           00352000
230994*     05  FILLER                          PIC  X(1840).           00353000
      *                                                                 00360000
      ******** ENDE COPY-MEMBER *************************************** 00370000
