      *---------------------------------------------------------------* 
      *    Standard für alle Objekte unter PVCS                         
      *            Datum   :  November 1995                             
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT                    
      *---------------------------------------------------------------* 
      *                                                                 
      *---------------------------------------------------------------* 
      *    Copyright 1995 ATLAS Dienstleistungs GmbH                    
      *---------------------------------------------------------------* 
      *    $Workfile:   DRAT0072.CPY  $                                 
      *    $Revision:   2.11  $                                         
      *                                                                 
      *    $Log:   L:/mf/CPY/DRAT0072.CPv  $                            
      *
      *   Rev 2.11   Feb 24 2006 16:25:04   t13ex13
      *AAS00595: Jahreswettbewerb 2006
      *
      *   Rev 2.10   Feb 11 2005 13:39:48   t13ex22
      *AAS00513: Drucklisten Jubiläums-Wettbewerbs/ Mittelmeer-Schi
      *ffsreise 2005. 
      *
      *   Rev 2.9   Jan 16 2004 15:22:48   t13ex22
      *FAS00119: Motivationslisten erhalten kein Gewinner-KZ
      *          Korrektur Faktor für gewertete EH durch dir. VB
      *
      *   Rev 2.8   Jan 06 2004 13:14:18   t13ex22
      *AAS00443: Anzeige VB-Stufe für AL-Liste per List-ID
      *LIST-ID 34 => mit Stufe, List-ID 35 => ohne Stufe
      *
      *   Rev 2.7   Dec 18 2003 11:59:46   t13ex22
      *AAS00443: Erweiterung für Wettbewerb 2004
      *
      *   Rev 2.6   Apr 30 2003 11:39:08   t13ex57
      *AAS00400 - Anpassung wg LP 2003
      *
      *   Rev 2.5   Apr 24 2003 14:35:54   t13ae35
      *AAS00400 - Anpassung bzgl. LP2003
      *                                                                 
      *   Rev 2.4   21 Mar 2001 15:44:52   T13AE35                      
      *AAS00264 - LP und WBW 2001; Listen 28, 29                        
      *und 30 neu                                                       
      *                                                                 
      *   Rev 2.3   13 Sep 2000 16:33:40   T13AE30                      
      *                                                                 
      *                                                                 
      *   Rev 2.2   Mar 01 2000 14:18:42   T13AE26                      
      *AAS00201 Jahreswettbewerbe 2000                                  
      *                                                                 
      *   Rev 2.1   Apr 12 1999 10:00:08   T13AE26                      
      *AAS00128 Anmerkung in LV-Listen                                  
      *jetzt Seitenfuß                                                  
      *                                                                 
      *                                                                 
      *   Rev 2.0   Mar 01 1999 11:07:58   T13AE26                      
      *Wettbewerbe 99                                                   
      *                                                                 
      *   Rev 1.6   30 Jan 1998 12:40:36   T13AE26                      
      *AAS00002 - Neue Listen fuer Wettbewerbe 98                       
      *                                                                 
      *   Rev 1.5   Apr 03 1997 10:13:50   T13AE24                      
      *AFVB0351, Anwärter mit ausgeben                                  
      *                                                                 
      *   Rev 1.0   Nov 04 1995 08:48:38   P13SP99                      
      *Initial revision.                                                
      *                                                                 
      *---------------------------------------------------------------* 
      ***************************************************************** 
      *    COPY-MEMBER: TABELLENEINTRÄGE LISG FÜR                     * 
      *                 STANDARD-GRUPPENAUFBEREITUNG                  * 
      *    --------------------------------------------------------   * 
      *    ERSTELLT: SCHÖLLHAMMER                                     * 
      ***************************************************************** 
      *    VERSION   2    25.03.94 09:27:21                             
      ****************************************************************  
      * AENDERUNGEN:                                                 *  
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *  
      * -------------------------------------------------------------*  
      * AFVB0065!02.02.94! 01 ! NEU                       ! SCHÖLLH. *  
      * AFVB0073!28.02.94!    ! EINTRAGUNGEN FUER LISTE 8 ! SCHÖLLH. *  
      *         !01.03.94! 02 ! PROD.UEBERGABE            ! SCHÖLLH. *  
      * AFVB0072!21.03.94! 03 ! LISTE 9 UND 10 EINGEFÜHRT ! BERGHOFER*  
      * AFVB0268!20.02.96! 04 ! NEUE LISTEN WETTBEWERB 96 ! SCHMIDT  *  
      * AFVB0272!01.04.96! 05 ! ZUS. WETTBEWERB FüR       !          *  
      *         !        !    ! D-LEITER (LISTE 15)       ! SCHMIDT  *  
      *         !        !    !                           !          *  
      * AFVB0288!24.06.96! 06 ! Gewinne mit ausgeben      !          *  
      *         !        !    ! in den Überschriften      ! SCHMIDT  *  
      * AFVB0343!24.02.97! 07 ! Neue Listen Wettbewerb 97 ! Schmidt  *  
      *         !        !    !                           !          *  
      * AFVB0351!01.04.97! 08 ! Anwärter mit ausgeben     ! Schmidt  *  
      * AAS00002!22.01.98! 09 ! Neue Liste 18 Wbw 98      ! T. Moll  *  
      * AAS00088!12.01.99! 10 ! Wbw 99; Neue Listen 23, 24! T. Moll  *  
      * AAS00128!29.03.99! 11 ! Liste 23 LV-Wbw 99: Grupp-!          *  
      *         !        !    ! enfuß jetzt Seitenfuß     ! T. Moll  *  
      * AAS00201!09.02.00!2.2 ! WBW 00: Listen 25, 26 neu ! T. Moll  *  
      * AAS00236!12.09.00!2.3 ! WBW 00: LISTE 27 neu      ! TH.WILLIG*  
      *--------------------------------------------------------------*  
      * AAS00264!14.03.01!2.4 ! Leistungsplan und WBW 2001! J.Hering *  
      *         !        !    ! Listen 28, 29 und 30 neu  !          *  
      *--------------------------------------------------------------*  
170403* AAS00400!17.04.03!2.5 ! LP2003 Liste 31           ! J.Hering *  
      *--------------------------------------------------------------*  
      * AAS00443!11.12.03!2.6 ! WBW 2004, LISTEN 32 33 34 ! T.MUND   *
      *         !06.01.04!2.7 ! WBW 2004, LISTE  35       ! T.MUND   *
      * AAS00595!09.02.06!2.8 ! WBW 2006, LISTEN 39 40 41 !GUTFLEISCH*
      *         !        !    !                           !          *  
      *         !        !    !                           !          *  
      *                                                              *  
      * ENDE-LOGBUCH                                                 *  
      ****************************************************************  
      *------------------------------------------------------------*    
      *  LIST-TABELLE, DIE EVTL. IN STUFE 2 NACH DB2 AUSGELAGERT   *    
      *  TAB: T-LISG (STEUERPARAMETER GRUPPE)                      *    
      *  KEY: - LISG-LIST-ID                                       *    
      *       - LISG-GRP-ID                                        *    
      *  ATTRIBUTE: - ID DER LISTE                                 *    
      *             - ID DER GRUPPE                                *    
      *             - KZ: NEUE SEITE ZU BEGINN DER GRUPPE    (J/N) *    
      *             - ANZAHL ZEILEN GRP-KOPF (INCL. LEERZEILEN)    *    
      *             - ANZAHL ZEILEN GRP-FUSS                       *    
      *             - ANZAHL ZEILEN SPALTEN-KOPF (INCL. LEERZEILEN)*    
      *             - ANZAHL ZEILEN DATENBLOCK                     *    
      *             - KZ: NACH SEITENWECHSEL NEUEN GRP-KOPF  (J/N) *    
      *             - KZ: NACH SEITENWECHSEL NEUEN SP-KOPF   (J/N) *    
      *             - KZ: BEI GRP-START AUF SEITENMITTE (D.H. ALS  *    
      *                   NICHT 1. GRUPPE) NEUEN GRP-KOPF    (J/N) *    
      *             - KZ: BEI GRP-START AUF SEITENMITTE (D.H. ALS  *    
      *                   NICHT 1. GRUPPE) NEUEN SP-KOPF     (J/N) *    
      *             - KZ: RANGW-KRITERIUM AUSWERTEN          (J/N) *    
      *                   IF 'N' WERDEN ZEILEN LFD. DURCHNUMMERIERT*    
      *             - KZ: BEI GLEICHEM RANG RANG-NR UNTERDRÜCK(J/N)*    
      *             - KZ: BEI GLEICHEM RANG AM GRUPPENENDE GRUPPE  *    
      *                   BIS ZUM RANGENDE VERLÄNGERN        (J/N) *    
      *------------------------------------------------------------*    
       01  T-LISG.                                                      
                                                                        
      *    * LISTE 1 / GRUPPE 1:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
      *    * LISTE 1 / GRUPPE 2:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
                                                                        
      *    * LISTE 2 / GRUPPE 1:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
      *    * LISTE 2 / GRUPPE 2:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
                                                                        
      *    * LISTE 3 / GRUPPE 1:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 3 / GRUPPE 2:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
                                                                        
      *    * LISTE 4 / GRUPPE 1:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 4 / GRUPPE 2:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
                                                                        
      *    * LISTE 5 / GRUPPE 1:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 5 / GRUPPE 2:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
                                                                        
      *    * LISTE 6 / GRUPPE 1:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   6.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 6 / GRUPPE 2:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   6.     
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 6 / GRUPPE 3:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   6.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
                                                                        
      *    * LISTE 7 / GRUPPE 1:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   7.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 7 / GRUPPE 2:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   7.     
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 7 / GRUPPE 3:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   7.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 7 / GRUPPE 4:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   7.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
                                                                        
      *    * LISTE 8 / GRUPPE 1:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   8.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 8 / GRUPPE 2:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   8.     
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 8 / GRUPPE 3:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   8.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 8 / GRUPPE 4:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   8.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 8 / GRUPPE 5:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   8.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
                                                                        
      *    * LISTE 9 / GRUPPE 1:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   9.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 9 / GRUPPE 2:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   9.     
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 9 / GRUPPE 3:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   9.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 9 / GRUPPE 4:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   9.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 9 / GRUPPE 5:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   9.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   9.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 9 / GRUPPE 6:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   9.     
               10 FILLER              PIC S9(004) COMP   VALUE   6.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 9 / GRUPPE 7:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE   9.     
               10 FILLER              PIC S9(004) COMP   VALUE   7.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
                                                                        
      *    * LISTE 10/ GRUPPE 1:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  10.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 10/ GRUPPE 2:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  10.     
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 10/ GRUPPE 3:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  10.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 10/ GRUPPE 4:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  10.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 10/ GRUPPE 5:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  10.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   9.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 10/ GRUPPE 6:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  10.     
               10 FILLER              PIC S9(004) COMP   VALUE   6.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   3.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 10/ GRUPPE 7:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  10.     
               10 FILLER              PIC S9(004) COMP   VALUE   7.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   5.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
200296                                                                  
200296*    * LISTE 11 / GRUPPE 1:                                       
200296     05  FILLER.                                                  
200296         10 FILLER              PIC S9(004) COMP   VALUE  11.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.     
200296         10 FILLER              PIC  X(001)        VALUE 'N'.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   5.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'N'.     
200296         10 FILLER              PIC  X(001)        VALUE 'N'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296*----------------------------------------------------------------*
200296* Wettbewerb zur Förderung der Lebensversichererung 1996 Liste 12*
200296*----------------------------------------------------------------*
200296*    * LISTE 12 / GRUPPE 1:                                       
200296     05  FILLER.                                                  
200296         10 FILLER              PIC S9(004) COMP   VALUE  12.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.     
200296         10 FILLER              PIC  X(001)        VALUE 'N'.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   5.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   4.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'N'.     
200296         10 FILLER              PIC  X(001)        VALUE 'N'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 12 / GRUPPE 2:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 12 / GRUPPE 3:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 12 / GRUPPE 4:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 12 / GRUPPE 5:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296*----------------------------------------------------------------*
200296* Wettbewerb zur Förderung der Unfallversichererung 1996 Liste 13*
200296*----------------------------------------------------------------*
200296*    * LISTE 13 / GRUPPE 1:                                       
200296     05  FILLER.                                                  
200296         10 FILLER              PIC S9(004) COMP   VALUE  13.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.     
200296         10 FILLER              PIC  X(001)        VALUE 'N'.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   5.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   4.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'N'.     
200296         10 FILLER              PIC  X(001)        VALUE 'N'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 13 / GRUPPE 2:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 13 / GRUPPE 3:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 13 / GRUPPE 4:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 13 / GRUPPE 5:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296*----------------------------------------------------------------*
200296* Wettbewerb zur Förderung neuer Vermögensberater 1996 Liste 14  *
200296*----------------------------------------------------------------*
200296*    * LISTE 14 / GRUPPE 1:                                       
200296     05  FILLER.                                                  
200296         10 FILLER              PIC S9(004) COMP   VALUE  14.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.     
200296         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.     
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'N'.     
200296         10 FILLER              PIC  X(001)        VALUE 'N'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
200296         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 14 / GRUPPE 2:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 14 / GRUPPE 3:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 14 / GRUPPE 4:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
010496*----------------------------------------------------------------*
010496* Zielwettbewerb für Direktionsleiter 1996   - Liste 15          *
010496*----------------------------------------------------------------*
010496*    * LISTE 15 / GRUPPE 1:                                       
010496     05  FILLER.                                                  
010496         10 FILLER              PIC S9(004) COMP   VALUE  15.     
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.     
010496         10 FILLER              PIC  X(001)        VALUE 'N'.     
010496         10 FILLER              PIC S9(004) COMP   VALUE   5.     
010496         10 FILLER              PIC S9(004) COMP   VALUE   0.     
010496         10 FILLER              PIC S9(004) COMP   VALUE   3.     
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.     
010496         10 FILLER              PIC  X(001)        VALUE 'J'.     
010496         10 FILLER              PIC  X(001)        VALUE 'J'.     
010496         10 FILLER              PIC  X(001)        VALUE 'N'.     
010496         10 FILLER              PIC  X(001)        VALUE 'N'.     
010496         10 FILLER              PIC  X(001)        VALUE 'J'.     
010496         10 FILLER              PIC  X(001)        VALUE 'J'.     
010496         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 15 / GRUPPE 2:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 15 / GRUPPE 3:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 15 / GRUPPE 4:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696*    * LISTE 15 / GRUPPE 5:                                       
240696     05  FILLER.                                                  
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC  X(001)        VALUE 'N'.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.     
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240696         10 FILLER              PIC  X(001)        VALUE 'J'.     
240297*----------------------------------------------------------------*
240297* Zielwettbewerb 1997 RGS - D  Liste 16                          *
240297*----------------------------------------------------------------*
240297*    * LISTE 16 / GRUPPE 1:                                       
240297     05  FILLER.                                                  
240297         10 FILLER              PIC S9(004) COMP   VALUE  16.     
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240297         10 FILLER              PIC  X(001)        VALUE 'N'.     
240297         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240297         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240297         10 FILLER              PIC S9(004) COMP   VALUE   3.     
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240297         10 FILLER              PIC  X(001)        VALUE 'J'.     
240297         10 FILLER              PIC  X(001)        VALUE 'J'.     
240297         10 FILLER              PIC  X(001)        VALUE 'N'.     
240297         10 FILLER              PIC  X(001)        VALUE 'N'.     
240297         10 FILLER              PIC  X(001)        VALUE 'J'.     
240297         10 FILLER              PIC  X(001)        VALUE 'J'.     
240297         10 FILLER              PIC  X(001)        VALUE 'J'.     
                                                                        
010497*    * LISTE 16 / GRUPPE 2:                                       
010497     05  FILLER.                                                  
010497         10 FILLER              PIC S9(004) COMP   VALUE  16.     
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.     
010497         10 FILLER              PIC  X(001)        VALUE 'N'.     
010497         10 FILLER              PIC S9(004) COMP   VALUE   4.     
010497         10 FILLER              PIC S9(004) COMP   VALUE   0.     
010497         10 FILLER              PIC S9(004) COMP   VALUE   3.     
010497         10 FILLER              PIC S9(004) COMP   VALUE   1.     
010497         10 FILLER              PIC  X(001)        VALUE 'J'.     
010497         10 FILLER              PIC  X(001)        VALUE 'J'.     
010497         10 FILLER              PIC  X(001)        VALUE 'J'.     
010497         10 FILLER              PIC  X(001)        VALUE 'J'.     
010497         10 FILLER              PIC  X(001)        VALUE 'J'.     
010497         10 FILLER              PIC  X(001)        VALUE 'J'.     
010497         10 FILLER              PIC  X(001)        VALUE 'J'.     
                                                                        
240297*----------------------------------------------------------------*
240297* Wettbewerb 1997, Lebensversicherung Liste 17                   *
240297*----------------------------------------------------------------*
240297*    * LISTE 17 / GRUPPE 1:                                       
240297     05  FILLER.                                                  
240297         10 FILLER              PIC S9(004) COMP   VALUE  17.     
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240297         10 FILLER              PIC  X(001)        VALUE 'N'.     
240297         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240297         10 FILLER              PIC S9(004) COMP   VALUE   0.     
240297         10 FILLER              PIC S9(004) COMP   VALUE   3.     
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.     
240297         10 FILLER              PIC  X(001)        VALUE 'J'.     
240297         10 FILLER              PIC  X(001)        VALUE 'J'.     
240297         10 FILLER              PIC  X(001)        VALUE 'N'.     
240297         10 FILLER              PIC  X(001)        VALUE 'N'.     
240297         10 FILLER              PIC  X(001)        VALUE 'J'.     
240297         10 FILLER              PIC  X(001)        VALUE 'J'.     
240297         10 FILLER              PIC  X(001)        VALUE 'J'.     
                                                                        
010497*    * LISTE 17 / GRUPPE 2:                                       
010497     05  FILLER.                                                  
010497         10 FILLER              PIC S9(004) COMP   VALUE  17.     
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.     
010497         10 FILLER              PIC  X(001)        VALUE 'N'.     
010497         10 FILLER              PIC S9(004) COMP   VALUE   4.     
010497         10 FILLER              PIC S9(004) COMP   VALUE   0.     
010497         10 FILLER              PIC S9(004) COMP   VALUE   3.     
010497         10 FILLER              PIC S9(004) COMP   VALUE   1.     
010497         10 FILLER              PIC  X(001)        VALUE 'J'.     
010497         10 FILLER              PIC  X(001)        VALUE 'J'.     
010497         10 FILLER              PIC  X(001)        VALUE 'J'.     
010497         10 FILLER              PIC  X(001)        VALUE 'J'.     
010497         10 FILLER              PIC  X(001)        VALUE 'J'.     
010497         10 FILLER              PIC  X(001)        VALUE 'J'.     
010497         10 FILLER              PIC  X(001)        VALUE 'J'.     
                                                                        
220198*----------------------------------------------------------------*
220198* Wettbewerb 1998, Zielwettbewerb     Liste 18  3 Gruppen        *
220198*----------------------------------------------------------------*
220198*    * LISTE 18/ GRUPPE 1:                                        
220198     05  FILLER.                                                  
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   4.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198*    * LISTE 18/ GRUPPE 2:                                        
220198     05  FILLER.                                                  
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   4.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198*    * LISTE 18/ GRUPPE 3:                                        
220198     05  FILLER.                                                  
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   4.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198*----------------------------------------------------------------*
220198* Wettbewerb 1998, Zielwettbewerb     Liste 19  3 Gruppen        *
220198*----------------------------------------------------------------*
220198*    * LISTE 19/ GRUPPE 1:                                        
220198     05  FILLER.                                                  
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   4.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198*    * LISTE 19/ GRUPPE 2:                                        
220198     05  FILLER.                                                  
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   4.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198*    * LISTE 19/ GRUPPE 3:                                        
220198     05  FILLER.                                                  
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   4.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198*----------------------------------------------------------------*
220198* Wettbewerb 1998, Zielwettbewerb     Liste 20  2 Gruppen        *
220198*----------------------------------------------------------------*
220198*    * LISTE 20/ GRUPPE 1:                                        
220198     05  FILLER.                                                  
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   4.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198*    * LISTE 20/ GRUPPE 2:                                        
220198     05  FILLER.                                                  
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   4.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198*----------------------------------------------------------------*
220198* Wettbewerb 1998, LV-Wettbewerb      Liste 21  3 Gruppen        *
220198*----------------------------------------------------------------*
220198*    * LISTE 21/ GRUPPE 1:                                        
220198     05  FILLER.                                                  
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   4.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198*    * LISTE 21/ GRUPPE 2:                                        
220198     05  FILLER.                                                  
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   4.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198*    * LISTE 21/ GRUPPE 3:                                        
220198     05  FILLER.                                                  
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   4.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198*----------------------------------------------------------------*
220198* Wettbewerb 1998, LV-Wettbewerb      Liste 22  2 Gruppen        *
220198*----------------------------------------------------------------*
220198*    * LISTE 22/ GRUPPE 1:                                        
220198     05  FILLER.                                                  
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   4.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198*    * LISTE 22/ GRUPPE 2:                                        
220198     05  FILLER.                                                  
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   4.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.     
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'N'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
220198         10 FILLER              PIC  X(001)        VALUE 'J'.     
                                                                        
120199*----------------------------------------------------------------*
120199* Wettbewerb 1999, LV-Wettbewerb      Liste 23  2 Gruppen        *
120199*----------------------------------------------------------------*
120199*    * LISTE 23/ GRUPPE 1: Gewinner                               
120199     05  FILLER.                                                  
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.     
120199         10 FILLER              PIC  X(001)        VALUE 'N'.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   5.     
290399*120199  10 FILLER              PIC S9(004) COMP   VALUE   3.     
290399         10 FILLER              PIC S9(004) COMP   VALUE   0.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   4.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'N'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199*    * LISTE 23/ GRUPPE 2: Anwärter                               
120199     05  FILLER.                                                  
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.     
120199         10 FILLER              PIC  X(001)        VALUE 'N'.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   4.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   4.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'N'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
                                                                        
120199*----------------------------------------------------------------*
120199* Wettbewerb 1999, Zielwettbewerb     Liste 24  2 Gruppen        *
120199*----------------------------------------------------------------*
120199*    * LISTE 24/ GRUPPE 1:                                        
120199     05  FILLER.                                                  
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.     
120199         10 FILLER              PIC  X(001)        VALUE 'N'.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   4.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   3.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'N'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199*    * LISTE 24/ GRUPPE 2:                                        
120199     05  FILLER.                                                  
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.     
120199         10 FILLER              PIC  X(001)        VALUE 'N'.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   4.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   3.     
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'N'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
120199         10 FILLER              PIC  X(001)        VALUE 'J'.     
                                                                        
090200*----------------------------------------------------------------*
090200* Wettbewerb 2000, Leistungen Eig.Ums Liste 25  2 Gruppen        *
090200*----------------------------------------------------------------*
090200*    * LISTE 25/ GRUPPE 1: Gewinner                               
090200     05  FILLER.                                                  
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.     
090200         10 FILLER              PIC  X(001)        VALUE 'N'.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   5.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   4.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'N'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200*    * LISTE 25/ GRUPPE 2: Anwärter                               
090200     05  FILLER.                                                  
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.     
090200         10 FILLER              PIC  X(001)        VALUE 'N'.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   4.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   4.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'N'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
                                                                        
090200*----------------------------------------------------------------*
090200* Wettbewerb 2000, Förd. neuer VB     Liste 26  2 Gruppen        *
090200*----------------------------------------------------------------*
090200*    * LISTE 26/ GRUPPE 1:                                        
090200     05  FILLER.                                                  
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.     
090200         10 FILLER              PIC  X(001)        VALUE 'N'.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   4.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   4.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'N'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200*    * LISTE 26/ GRUPPE 2:                                        
090200     05  FILLER.                                                  
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.     
090200         10 FILLER              PIC  X(001)        VALUE 'N'.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   4.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   4.     
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'N'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
090200         10 FILLER              PIC  X(001)        VALUE 'J'.     
                                                                        
120900*----------------------------------------------------------------*
120900* Wettbewerb 2000, Leistungen Eig.Ums Liste 27  2 Gruppen        *
120900*----------------------------------------------------------------*
120900*    * LISTE 27/ GRUPPE 1: Gewinner                               
120900     05  FILLER.                                                  
120900         10 FILLER              PIC S9(004) COMP   VALUE  27.     
120900         10 FILLER              PIC S9(004) COMP   VALUE   1.     
120900         10 FILLER              PIC  X(001)        VALUE 'N'.     
120900         10 FILLER              PIC S9(004) COMP   VALUE   5.     
120900         10 FILLER              PIC S9(004) COMP   VALUE   0.     
120900         10 FILLER              PIC S9(004) COMP   VALUE   4.     
120900         10 FILLER              PIC S9(004) COMP   VALUE   1.     
120900         10 FILLER              PIC  X(001)        VALUE 'J'.     
120900         10 FILLER              PIC  X(001)        VALUE 'J'.     
120900         10 FILLER              PIC  X(001)        VALUE 'J'.     
120900         10 FILLER              PIC  X(001)        VALUE 'N'.     
120900         10 FILLER              PIC  X(001)        VALUE 'J'.     
120900         10 FILLER              PIC  X(001)        VALUE 'J'.     
120900         10 FILLER              PIC  X(001)        VALUE 'J'.     
120900*    * LISTE 27/ GRUPPE 2: Anwärter                               
120900     05  FILLER.                                                  
120900         10 FILLER              PIC S9(004) COMP   VALUE  27.     
120900         10 FILLER              PIC S9(004) COMP   VALUE   2.     
120900         10 FILLER              PIC  X(001)        VALUE 'N'.     
120900         10 FILLER              PIC S9(004) COMP   VALUE   4.     
120900         10 FILLER              PIC S9(004) COMP   VALUE   0.     
120900         10 FILLER              PIC S9(004) COMP   VALUE   4.     
120900         10 FILLER              PIC S9(004) COMP   VALUE   1.     
120900         10 FILLER              PIC  X(001)        VALUE 'J'.     
120900         10 FILLER              PIC  X(001)        VALUE 'J'.     
120900         10 FILLER              PIC  X(001)        VALUE 'J'.     
120900         10 FILLER              PIC  X(001)        VALUE 'N'.     
120900         10 FILLER              PIC  X(001)        VALUE 'J'.     
120900         10 FILLER              PIC  X(001)        VALUE 'J'.     
120900         10 FILLER              PIC  X(001)        VALUE 'J'.     
                                                                        
140301*----------------------------------------------------------------*
      * LP u. WBW 2001 Praxisstufe          Liste 28  2 Gruppen        *
140301*----------------------------------------------------------------*
      *    * LISTE 28/ GRUPPE 1:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  28.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 28/ GRUPPE 2:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  28.     
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
140301*---------Ende Liste 28------------------------------------------*
                                                                        
140301*----------------------------------------------------------------*
      * LP u. WBW 2001 Stufen RGS - D       Liste 29  2 Gruppen        *
140301*----------------------------------------------------------------*
      *    * LISTE 29/ GRUPPE 1:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  29.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 29/ GRUPPE 2:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  29.     
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
140301*---------Ende Liste 29------------------------------------------*
                                                                        
                                                                        
140301*----------------------------------------------------------------*
      * LP u. WBW 2001 Stufe AL             Liste 30  2 Gruppen        *
140301*----------------------------------------------------------------*
      *    * LISTE 30: GRUPPE 1:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  30.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 30/ GRUPPE 2:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  30.     
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
140301*---------Ende Liste 30------------------------------------------*
                                                                        
170403*----------------------------------------------------------------*
      * LP2003         Stufen RGS - D       Liste 31  2 Gruppen        *
      *----------------------------------------------------------------*
      *    * LISTE 31/ GRUPPE 1:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  31.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
      *    * LISTE 31/ GRUPPE 2:                                        
           05  FILLER.                                                  
               10 FILLER              PIC S9(004) COMP   VALUE  31.     
               10 FILLER              PIC S9(004) COMP   VALUE   2.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   0.     
               10 FILLER              PIC S9(004) COMP   VALUE   4.     
               10 FILLER              PIC S9(004) COMP   VALUE   1.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'N'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
               10 FILLER              PIC  X(001)        VALUE 'J'.     
170403*---------Ende Liste 31------------------------------------------*
041203*----------------------------------------------------------------*
      * LP2004  GRUPPENAUFBAU LISTE 32      GRUPPEN 1 - 6
      *         EIGENGESCHÄFT LISTE 32      GRUPPEN 7 -11
      *----------------------------------------------------------------*
      *    * LISTE 32/ GRUPPE 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 32/ GRUPPE 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 32/ GRUPPE 3:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 32/ GRUPPE 4:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 32/ GRUPPE 5:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 32/ GRUPPE 6:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 32/ GRUPPE 7:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 32/ GRUPPE 8:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 32/ GRUPPE 9:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 32/ GRUPPE 10:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 32/ GRUPPE 11:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC S9(004) COMP   VALUE  11.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
041203*---------ENDE LISTE 32------------------------------------------*
                                                                        
041203*----------------------------------------------------------------*
      * LP2004  MOTIVATIONSLISTE GRUPPENAUFBAU LISTE 33 GRUPPEN 1
      *         MOTIVATIONSLISTE EIGENUMSATZ   LISTE 33 GRUPPEN 2
      *----------------------------------------------------------------*
      *    * LISTE 33/ GRUPPE 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  33.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 33/ GRUPPE 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  33.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
041203*---------ENDE LISTE 33------------------------------------------*
                                                                        
041203*----------------------------------------------------------------*
      * LP2004  ERFOLGE NEUE AGENTURLEITER LISTE 34     GRUPPE  1
      *----------------------------------------------------------------*
      *    * LISTE 34/ GRUPPE 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 34/ GRUPPE 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
060104*----------------------------------------------------------------*
      * LP2004  ERFOLGE NEUE AGENTURLEITER LISTE 35     GRUPPE  1
      *----------------------------------------------------------------*
      *    * LISTE 35/ GRUPPE 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 35/ GRUPPE 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
030105*---------------- Ende Liste 35 ---------------------------------*
041203*----------------------------------------------------------------*
      * JBW2004 GRUPPENAUFBAU LISTE 36      GRUPPEN 1 - 6 < D-Leiter
      *         GRUPPENAUFBAU LISTE 36      GRUPPEN 7 -11 = D-Leiter
      *----------------------------------------------------------------*
      *    * LISTE 36/ GRUPPE 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 36/ GRUPPE 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 36/ GRUPPE 3:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 36/ GRUPPE 4:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 36/ GRUPPE 5:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 36/ GRUPPE 6:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 36/ GRUPPE 7:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 36/ GRUPPE 8:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 36/ GRUPPE 9:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 36/ GRUPPE 10:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 36/ GRUPPE 11:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC S9(004) COMP   VALUE  11.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
030105*---------ENDE LISTE 36------------------------------------------*
030105*----------------------------------------------------------------*
      * JBW2005 EIGENGESCHÄFT LISTE 37 GRUPPE 1 AL BIS P4
      *         EIGENGESCHÄFT LISTE 37 GRUPPE 2 P5 BIS P7
      *----------------------------------------------------------------*
      *    * LISTE 37/ GRUPPE 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 37/ GRUPPE 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
030105*---------ENDE LISTE 37------------------------------------------*
030105*----------------------------------------------------------------*
      * JBW2005 ERFOLGE NEUE AGENTURLEITER LISTE 38     GRUPPE  1
      *----------------------------------------------------------------*
      *    * LISTE 38/ GRUPPE 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 38/ GRUPPE 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
030105*---------------- ENDE LISTE 38 ---------------------------------*
090206*----------------------------------------------------------------*
      * JBW2006 GRUPPENAUFBAU LISTE 39      GRUPPEN 1 - 5 < D-LEITER
      *         GRUPPENAUFBAU LISTE 39      GRUPPEN 6 -10 = D-LEITER
      *         GRUPPENAUFBAU LISTE 39      GRUPPE  11    = DL PANN.
      *----------------------------------------------------------------*
      *    * LISTE 39/ GRUPPE 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 39/ GRUPPE 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 39/ GRUPPE 3:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 39/ GRUPPE 4:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 39/ GRUPPE 5:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 39/ GRUPPE 6:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 39/ GRUPPE 7:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 39/ GRUPPE 8:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 39/ GRUPPE 9:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 39/ GRUPPE 10:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 39/ GRUPPE 11:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC S9(004) COMP   VALUE  11.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
090206*---------ENDE LISTE 39------------------------------------------*
090206*----------------------------------------------------------------*
      * JBW2006 EIGENGESCHÄFT LISTE 40 GRUPPE 1 AL BIS P4
      *         EIGENGESCHÄFT LISTE 40 GRUPPE 2 P5 BIS P7
      *----------------------------------------------------------------*
      *    * LISTE 40/ GRUPPE 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
      *    * LISTE 40/ GRUPPE 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
090206*---------ENDE LISTE 40------------------------------------------*
090206*----------------------------------------------------------------*
      * JBW2006 ERFOLGE NEUE AGENTURLEITER LISTE 41     GRUPPE  1
      *----------------------------------------------------------------*
      *    * LISTE 41/ GRUPPE 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
090206*----------------------------------------------------------------*
      * JBW2006 ERFOLGE NEUE AGENTURLEITER LISTE 41     GRUPPE  2
      * Diese Liste wird nur wegen eines Fehlers in der Programmlogik
      * benötigt und hat keinen fachlichen Hintergrund.
      *----------------------------------------------------------------*
      *    * LISTE 41/ GRUPPE 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'N'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
               10 FILLER              PIC  X(001)        VALUE 'J'.
090206*---------------- ENDE LISTE 41 ---------------------------------*
      *----------------------------------------------------------------*
      *--- Anzahl Zeilen im OCCURS                                 ----*
      *----------------------------------------------------------------*
       01  FILLER REDEFINES T-LISG.                                     
170403* 140301     05  T-LISG-ZEILE OCCURS 89                           
041203*    05  T-LISG-ZEILE OCCURS 91
060104*    05  T-LISG-ZEILE OCCURS 106
030105*    05  T-LISG-ZEILE OCCURS 108
030105*    05  T-LISG-ZEILE OCCURS 123
080206     05  T-LISG-ZEILE OCCURS 138
                            INDEXED BY I-LISG.                          
               10 T-LISG-LIST-ID              PIC S9(004) COMP.         
               10 T-LISG-GRP-ID               PIC S9(004) COMP.         
               10 T-LISG-NEUE-SEITE-KZ        PIC  X(001).              
               10 T-LISG-GRP-KOPF-ZL-ANZ      PIC S9(004) COMP.         
               10 T-LISG-GRP-FUSS-ZL-ANZ      PIC S9(004) COMP.         
               10 T-LISG-SP-KOPF-ZL-ANZ       PIC S9(004) COMP.         
               10 T-LISG-DATEN-BLOCK-ZL-ANZ   PIC S9(004) COMP.         
               10 T-LISG-SW-GRP-KOPF-KZ       PIC  X(001).              
               10 T-LISG-SW-SP-KOPF-KZ        PIC  X(001).              
               10 T-LISG-SEITMIT-GRP-KOPF-KZ  PIC  X(001).              
               10 T-LISG-SEITMIT-SP-KOPF-KZ   PIC  X(001).              
               10 T-LISG-RANGW-KRIT-AUSWERT   PIC  X(001).              
               10 T-LISG-RANGNR-GL-UNTERDR    PIC  X(001).              
               10 T-LISG-RANG-ENDE-KZ         PIC  X(001).              
      *                                                                 
      ******** ENDE COPY-MEMBER (DRAT0072) ***************************  
                                                                        
