      *---------------------------------------------------------------*
      *    STANDARD FÜR ALLE OBJEKTE UNTER PVCS
      *            DATUM   :  NOVEMBER 1995
      *            KOPF AUS:  N:\PROFILE\KOPFCBL.DAT
      *--------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    COPYRIGHT 1995 ATLAS DIENSTLEISTUNGS GMBH
      *---------------------------------------------------------------*
      *    $Workfile:   DRAT0069.CPY  $
      *    $Revision:   2.13  $
      *
      *    $Log:   L:/mf/CPY/DRAT0069.CPv  $
      *
      *   Rev 2.13   Feb 24 2006 16:25:16   t13ex13
      *AAS00595: Jahreswettbewerb 2006
      *
      *   Rev 2.12   Feb 11 2005 13:39:20   t13ex22
      *AAS00513: Drucklisten Jubiläums-Wettbewerbs/ Mittelmeer-Schi
      *ffsreise 2005. 
      *
      *   Rev 2.11   Jun 16 2004 11:04:48   t13ex22
      *Jahreswettbewerb 2004 Anzeige Schiffsreise.
      *
      *   Rev 2.10   Jan 16 2004 15:20:34   t13ex22
      *FAS00119: Motivationslisten erhalten kein Gewinner-KZ
      *          Korrektur Faktor für gewertete EH durch dir. VB
      *      
      *   Rev 2.9   Jan 06 2004 13:13:50   t13ex22
      *AAS00443: Anzeige VB-Stufe für AL-Liste per List-ID
      *LIST-ID 34 => mit Stuef, List-ID 35 => ohne Stufe
      *
      *   Rev 2.8   Dec 18 2003 11:59:28   t13ex22
      *AAS00443: Erweiterung für Wettbewerb 2004
      *
      *   REV 2.7   APR 30 2003 11:38:30   T13EX57
      *AAS00400 - ANPASSUNG WG LP 2003
      *
      *   REV 2.6   APR 24 2003 14:35:26   T13AE35
      *AAS00400 - ANPASSUNG BZGL LP2003
      *
      *   REV 2.5   26 MAR 2001 08:21:34   T13AE35
      *AAS00264 - ANPASSUNG FUSSZEILE FÜR LP
      *
      *   REV 2.4   21 MAR 2001 15:44:02   T13AE35
      *AAS00264 - LP UND WBW 2001; LISTEN 28,
      *29 UND 30 NEU
      *
      *   REV 2.3   13 SEP 2000 16:33:30   T13AE30
      *
      *
      *   REV 2.2   MAR 01 2000 14:18:34   T13AE26
      *AAS00201 JAHRESWETTBEWERBE 2000
      *
      *   REV 2.1   APR 12 1999 10:00:02   T13AE26
      *AAS00128 ANMERKUNG IN LV-LISTEN
      *JETZT SEITENFUß
      *
      *
      *   REV 2.0   MAR 01 1999 11:07:42   T13AE26
      *WETTBEWERBE 99
      *
      *   REV 1.7   30 JAN 1998 12:39:52   T13AE26
      *AAS00002 - NEUE LISTEN FUER WETTBEWERBE 98
      *
      *   REV 1.6   APR 03 1997 10:13:04   T13AE24
      *AFVB0351, ANWÄRTER MIT AUSGEBEN
      *
      *   REV 1.0   NOV 04 1995 08:47:54   P13SP99
      *INITIAL REVISION.
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: TABELLENEINTRÄGE LID FÜR GRUPPEN- UND         *
      *                 LISTEN-KÖPFE UND -FÜSSE                       *
      *    --------------------------------------------------------   *
      *    ERSTELLT: SCHÖLLHAMMER                                     *
      *****************************************************************
      *    VERSION   4    22.04.94 14:09:53
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AFVB0065!09.02.94! 01 ! NEU                       ! SCHÖLLH. *
      * AFVB0073!28.02.94!    ! EINTRAGUNGEN FUER LISTE 8 ! SCHÖLLH. *
      *         !01.03.94! 02 ! PROD.UEBERGABE            ! SCHÖLLH. *
      * AFVB0089!11.03.94! 03 ! LISTE 8, SPALTENKÖPFE GE- ! BERGHOFER*
      *         !        !    ! ÄNDERT                    !          *
      * AFVB0088!21.03.94! 04 ! ALLE SEITENFÜßE MIT RAHMEN! SCHÖLLH. *
      *         !   "    !    ! LISTE 9 UND LISTE 10 EIN- ! BERGHOFER*
      *         !        !    ! GEFÜHRT                   !          *
      * AFVB0104!20.04.94! 05 ! FUßZEILEN WETTBEWERBE GE- ! BERGHOFER*
      *         !        !    ! ÄNDERT                    !          *
      * AFVB0268!20.02.96! 06 ! NEUE LISTEN FÜR WETTBEWERB!          *
      *         !        !    ! 96                        ! SCHMIDT  *
      * AFVB0272!01.04.96! 07 ! ZUS. WETTBEWERB FÜR       !          *
      *         !        !    ! D-LEITER (LISTE 15)       ! SCHMIDT  *
      * AFVB0288!24.06.96! 08 ! WETTBEWERBS-GEWINNE ALS   !          *
      *         !        !    ! GRUPPEN-ÜBERSCHRIFTEN MIT !          *
      *         !        !    ! AUSGEBEN                  ! SCHMIDT  *
      * AFVB0295!02.07.96! 09 ! SCHREIBFEHLER KORRIGIERT  ! SCHMIDT  *
      * AFVB0343!24.02.97! 10 ! WETTBEWERB 97, NEUE LISTEN! SCHMIDT  *
      * AFVB0351!01.04.97! 11 ! WETTBEWERB 97, ANWÄRTER   !          *
      *         !        !    ! MIT AUSWEISEN             ! SCHMIDT  *
      * AAS00002!22.01.98! 12 ! LISTE 18 WETTBEWERB 98    ! T. MOLL  *
      * AAS00088!12.01.99! 13 ! WBW 99; NEUE LISTEN 23, 24! T. MOLL  *
      * AAS00128!29.03.99! 14 ! FUßZEILE LISTE 23 GEÄNDERT!          *
      *         !        !    ! (LV-WBW 99)               ! T. MOLL  *
      * AAS00201!09.02.00!2.2 ! WBW 00: LISTEN 25, 26 NEU ! T. MOLL  *
      * AAS00236!12.09.00!2.3 ! WBW 00: LISTE 27 NEU      ! TH.WILLIG*
      *--------------------------------------------------------------*
      * AAS00264!14.03.01!2.4 ! LEISTUNGSPLAN UND WBW 2001! J.HERING *
      *         !        !    ! LISTEN 28, 29 UND 30 NEU  !          *
      *--------------------------------------------------------------*
170403* AAS00400!17.04.03!2.6 ! LP2003 LISTE 31           ! J.HERING *
      *--------------------------------------------------------------*
170403* AAS00443!04.12.03!2.7 ! LP2004 LISTE 32, 33 UND 34! T.MUND   *
150104*--------------------------------------------------------------*
      * FAS00117!15.01.04!2.8 ! LP2004 Motivationsliste   ! T.Mund   *
      *         !        !    ! nur als Anwärter          !          *
      *--------------------------------------------------------------*
      * AAS00513!03.01.05!2.9 ! JBW2005; LISTEN 36-38     ! T.MUND   *
      *--------------------------------------------------------------*
      * AAS00595!09.02.06!3.0 ! JBW2006; LISTEN 39-41     !GUTFLEISCH*
      *--------------------------------------------------------------*
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *------------------------------------------------------------*
      *  LIST-TABELLE, DIE EVTL. IN STUFE 2 NACH DB2 AUSGELAGERT   *
      *  TAB: T-LID (DATENZEILEN ZU KÖPFEN ODER FÜSSEN)            *
      *  KEY: - LID-LIST-ID                                        *
      *       - LID-DATEN-TYP                                      *
      *       - LID-TYP-LFD-NR                                     *
      *       - LID-TEXT-LFD-NR                                    *
      *  ATTRIBUTE: - ID DER LISTE                                 *
      *             - TYP DER DATENZEILE (Z.B. 'SK'=SEITENKOPF)    *
      *             - LFD NR DES TYPS DER DATENZEILE               *
      *                 (Z.B. 2. GRP-KOPF)                         *
      *             - LFD NR DER DATENZEILE                        *
      *             - LEERZEILEN VOR DER ZEILE                     *
      *             - ZU DRUCKENDER TEXT                           *
      *------------------------------------------------------------*
       01  T-LID.

      *------------------------------------------------------------*
      *      LISTE 1: WETTBEWERB GS - D                            *
      *------------------------------------------------------------*
      *    * LISTE 1: SEITENKOPF-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     AUFENTHALT IN VILA VERDE
      -                 '                                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                 '                                           '.

      *    * LISTE 1: SEITENFUSS-ZEILEN
210394*    *05  FILLER.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394*         10 FILLER              PIC  X(132)        VALUE
210394*                         '  STAND: #DDDDDDDD#
210394*-                 '                              SEITE: #S#   '.

210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC  X(001)      VALUE     X'AC'.
210394         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
210394         10 FILLER              PIC  X(001)      VALUE     X'BC'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.
210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   2.
210394         10 FILLER              PIC S9(004) COMP   VALUE   0.
210394         10 FILLER              PIC  X(001)      VALUE     X'FA'.
210394         10 FILLER              PIC  X(080)        VALUE
200494*                         ' STAND: #DDDDDDDD#
200494                          ' STAND ABRECHNUNG: #DSTAT#
210394-                 '                              SEITE: #S# '.
210394         10 FILLER              PIC  X(001)      VALUE     X'FA'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.
210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394         10 FILLER              PIC S9(004) COMP   VALUE   0.
210394         10 FILLER              PIC  X(001)      VALUE     X'AB'.
210394         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
210394         10 FILLER              PIC  X(001)      VALUE     X'BB'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.

      *    * LISTE 1 / GRUPPENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 1 / SPALTENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR.  NAME                 VO
      -                 'RNAME      STUFE  ANZAHL EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                 NEUE VB        NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 1 / GRUPPENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               '  ANWÄRTER
      -                 '                                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 1 / SPALTENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR.  NAME                 VO
      -                 'RNAME      STUFE  ANZAHL EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                 NEUE VB        NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *------------------------------------------------------------*
      *      LISTE 2: WETTBEWERB AL - RGS                          *
      *------------------------------------------------------------*
      *    * LISTE 2: SEITENKOPF-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     AUFENTHALT IM SCHULUNGS- UND
      -                 ' FAMILIENPARADIES PANNONIA                 '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                 '                                           '.

      *    * LISTE 2: SEITENFUSS-ZEILEN
210394*    *05  FILLER.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   2.
210394*         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394*         10 FILLER              PIC  X(132)        VALUE
210394*                         '  STAND: #DDDDDDDD#
210394*-                 '                              SEITE: #S#   '.

210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   2.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC  X(001)      VALUE     X'AC'.
210394         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
210394         10 FILLER              PIC  X(001)      VALUE     X'BC'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.
210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   2.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   2.
210394         10 FILLER              PIC S9(004) COMP   VALUE   0.
210394         10 FILLER              PIC  X(001)      VALUE     X'FA'.
210394         10 FILLER              PIC  X(080)        VALUE
200494*                         ' STAND: #DDDDDDDD#
200494                          ' STAND ABRECHNUNG: #DSTAT#
210394-                 '                              SEITE: #S# '.
210394         10 FILLER              PIC  X(001)      VALUE     X'FA'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.
210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   2.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394         10 FILLER              PIC S9(004) COMP   VALUE   0.
210394         10 FILLER              PIC  X(001)      VALUE     X'AB'.
210394         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
210394         10 FILLER              PIC  X(001)      VALUE     X'BB'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.

      *    * LISTE 2 / GRUPPENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 2 / SPALTENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR.  NAME                 VO
      -                 'RNAME      STUFE  ANZAHL EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                 NEUE VB        NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 2 / GRUPPENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               '  ANWÄRTER
      -                 '                                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 2 / SPALTENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR.  NAME                 VO
      -                 'RNAME      STUFE  ANZAHL EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                 NEUE VB        NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *------------------------------------------------------------*
      *    * LISTE 3: WETTBEWERB DIREKTIONEN                       *
      *------------------------------------------------------------*
      *    * LISTE 3: SEITENKOPF-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 3: SEITENFUSS-ZEILEN
210394*    *05  FILLER.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394*         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394*         10 FILLER              PIC  X(132)        VALUE
210394*                         '  STAND: #DDDDDDDD#
210394*-                 '                              SEITE: #S#   '.

210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC  X(001)      VALUE     X'AC'.
210394         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
210394         10 FILLER              PIC  X(001)      VALUE     X'BC'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.
210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   2.
210394         10 FILLER              PIC S9(004) COMP   VALUE   0.
210394         10 FILLER              PIC  X(001)      VALUE     X'FA'.
210394         10 FILLER              PIC  X(080)        VALUE
200494*                         ' STAND: #DDDDDDDD#
200494                          ' STAND ABRECHNUNG: #DSTAT#
210394-                 '                              SEITE: #S# '.
210394         10 FILLER              PIC  X(001)      VALUE     X'FA'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.
210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394         10 FILLER              PIC S9(004) COMP   VALUE   0.
210394         10 FILLER              PIC  X(001)      VALUE     X'AB'.
210394         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
210394         10 FILLER              PIC  X(001)      VALUE     X'BB'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.

      *    * LISTE 3 / GRUPPENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     TRAUMREISE IN DEN WESTEN DER
      -                 ' USA                                       '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------     UND BEGEGNUNG MIT DR. POHL I
      -                 'N SONOMA                                   '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 3 / SPALTENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG   DIR VB-NR.    NAME
      -                 '  VORNAME                EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 3 / GRUPPENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               '  ANWÄRTER
      -                 '                                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 3 / SPALTENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG   DIR VB-NR.    NAME
      -                 '  VORNAME                EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *------------------------------------------------------------*
      *    * LISTE 4: WETTBEWERB RD1/RD2                           *
      *------------------------------------------------------------*
      *    * LISTE 4: SEITENKOPF-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 4: SEITENFUSS-ZEILEN
210394*    *05  FILLER.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   4.
210394*         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394*         10 FILLER              PIC  X(132)        VALUE
210394*                         '  STAND: #DDDDDDDD#
210394*-                 '                              SEITE: #S#   '.

210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   4.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC  X(001)      VALUE     X'AC'.
210394         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
210394         10 FILLER              PIC  X(001)      VALUE     X'BC'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.
210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   4.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   2.
210394         10 FILLER              PIC S9(004) COMP   VALUE   0.
210394         10 FILLER              PIC  X(001)      VALUE     X'FA'.
210394         10 FILLER              PIC  X(080)        VALUE
200494*                         ' STAND: #DDDDDDDD#
200494                          ' STAND ABRECHNUNG: #DSTAT#
210394-                 '                              SEITE: #S# '.
210394         10 FILLER              PIC  X(001)      VALUE     X'FA'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.
210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   4.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394         10 FILLER              PIC S9(004) COMP   VALUE   0.
210394         10 FILLER              PIC  X(001)      VALUE     X'AB'.
210394         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
210394         10 FILLER              PIC  X(001)      VALUE     X'BB'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.

      *    * LISTE 4 / GRUPPENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     TRAUMREISE IN DEN WESTEN DER
      -                 ' USA                                       '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------     UND BEGEGNUNG MIT DR. POHL I
      -                 'N SONOMA                                   '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 4 / SPALTENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG   DIR VB-NR.    NAME
      -                 '  VORNAME                EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 4 / GRUPPENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               '  ANWÄRTER
      -                 '                                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 4 / SPALTENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG   DIR VB-NR.    NAME
      -                 '  VORNAME                EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *------------------------------------------------------------*
      *    * LISTE 5: WETTBEWERB HAUPTGESCHÄFTSSTELLENLEITER       *
      *------------------------------------------------------------*
      *    * LISTE 5: SEITENKOPF-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                            '.

      *    * LISTE 5: SEITENFUSS-ZEILEN
210394*    *05  FILLER.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   5.
210394*         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394*         10 FILLER              PIC  X(132)        VALUE
210394*                         '  STAND: #DDDDDDDD#
210394*-                 '                              SEITE: #S#   '.

210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   5.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC  X(001)      VALUE     X'AC'.
210394         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
210394         10 FILLER              PIC  X(001)      VALUE     X'BC'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.
210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   5.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   2.
210394         10 FILLER              PIC S9(004) COMP   VALUE   0.
210394         10 FILLER              PIC  X(001)      VALUE     X'FA'.
210394         10 FILLER              PIC  X(080)        VALUE
200494*                         ' STAND: #DDDDDDDD#
200494                          ' STAND ABRECHNUNG: #DSTAT#
210394-                 '                              SEITE: #S# '.
210394         10 FILLER              PIC  X(001)      VALUE     X'FA'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.
210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   5.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394         10 FILLER              PIC S9(004) COMP   VALUE   0.
210394         10 FILLER              PIC  X(001)      VALUE     X'AB'.
210394         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
210394         10 FILLER              PIC  X(001)      VALUE     X'BB'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.

      *    * LISTE 5 / GRUPPENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     TRAUMREISE IN DEN WESTEN DER
      -                 ' USA                                       '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------     UND BEGEGNUNG MIT DR. POHL I
      -                 'N SONOMA                                   '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 5 / SPALTENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG   DIR VB-NR.    NAME
      -                 '  VORNAME                EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 5 / GRUPPENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               '  ANWÄRTER
      -                 '                                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 5 / SPALTENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG   DIR VB-NR.    NAME
      -                 '  VORNAME                EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *------------------------------------------------------------*
      *    * LISTE 6: WETTBEWERB GESCHÄFTSSTELLENLEITER            *
      *------------------------------------------------------------*
      *    * LISTE 6: SEITENKOPF-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 6: SEITENFUSS-ZEILEN
210394*    *05  FILLER.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   6.
210394*         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394*         10 FILLER              PIC  X(132)        VALUE
210394*                         '  STAND: #DDDDDDDD#
210394*-                 '                              SEITE: #S#   '.

210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   6.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC  X(001)      VALUE     X'AC'.
210394         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
210394         10 FILLER              PIC  X(001)      VALUE     X'BC'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.
210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   6.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   2.
210394         10 FILLER              PIC S9(004) COMP   VALUE   0.
210394         10 FILLER              PIC  X(001)      VALUE     X'FA'.
210394         10 FILLER              PIC  X(080)        VALUE
200494*                         ' STAND: #DDDDDDDD#
200494                          ' STAND ABRECHNUNG: #DSTAT#
210394-                 '                              SEITE: #S# '.
210394         10 FILLER              PIC  X(001)      VALUE     X'FA'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.
210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   6.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394         10 FILLER              PIC S9(004) COMP   VALUE   0.
210394         10 FILLER              PIC  X(001)      VALUE     X'AB'.
210394         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
210394         10 FILLER              PIC  X(001)      VALUE     X'BB'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.

      *    * LISTE 6 / GRUPPENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     TRAUMREISE IN DEN WESTEN DER
      -                 ' USA                                       '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------     UND BEGEGNUNG MIT DR. POHL I
      -                 'N SONOMA                                   '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 6 / SPALTENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG   DIR VB-NR.    NAME
      -                 '  VORNAME                EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 6 / GRUPPENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     EIN ABENTEUER IM MORGENLAND
      -                 '- ENTDECKUNGSREISE NACH                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------     DUBAI/ARABISCHE EMIRATE
      -                 '                                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 6 / SPALTENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG   DIR VB-NR.    NAME
      -                 '  VORNAME                EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 6 / GRUPPENKOPF 3:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               '  ANWÄRTER
      -                 '                                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 6 / SPALTENKOPF 3:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG   DIR VB-NR.    NAME
      -                 '  VORNAME                EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *------------------------------------------------------------*
      *    * LISTE 7: WETTBEWERB REGIONALGESCHÄFTSSTELLENLEITER    *
      *------------------------------------------------------------*
      *    * LISTE 7: SEITENKOPF-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 7: SEITENFUSS-ZEILEN
210394*    *05  FILLER.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   7.
210394*         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394*         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394*         10 FILLER              PIC  X(132)        VALUE
210394*                         '  STAND: #DDDDDDDD#
210394*-                 '                              SEITE: #S#   '.

210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   7.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC  X(001)      VALUE     X'AC'.
210394         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
210394         10 FILLER              PIC  X(001)      VALUE     X'BC'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.
210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   7.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   2.
210394         10 FILLER              PIC S9(004) COMP   VALUE   0.
210394         10 FILLER              PIC  X(001)      VALUE     X'FA'.
210394         10 FILLER              PIC  X(080)        VALUE
200494*                         ' STAND: #DDDDDDDD#
200494                          ' STAND ABRECHNUNG: #DSTAT#
210394-                 '                              SEITE: #S# '.
210394         10 FILLER              PIC  X(001)      VALUE     X'FA'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.
210394     05  FILLER.
210394         10 FILLER              PIC S9(004) COMP   VALUE   7.
210394         10 FILLER              PIC  X(002)        VALUE 'SF'.
210394         10 FILLER              PIC S9(004) COMP   VALUE   1.
210394         10 FILLER              PIC S9(004) COMP   VALUE   3.
210394         10 FILLER              PIC S9(004) COMP   VALUE   0.
210394         10 FILLER              PIC  X(001)      VALUE     X'AB'.
210394         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
210394         10 FILLER              PIC  X(001)      VALUE     X'BB'.
210394         10 FILLER              PIC  X(050)        VALUE SPACE.

      *    * LISTE 7 / GRUPPENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     TRAUMREISE IN DEN WESTEN DER
      -                 ' USA                                       '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------     UND BEGEGNUNG MIT DR. POHL I
      -                 'N SONOMA                                   '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 7 / SPALTENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG   DIR VB-NR.    NAME
      -                 '  VORNAME                EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 7 / GRUPPENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     EIN ABENTEUER IM MORGENLAND
      -                 '- ENTDECKUNGSREISE NACH                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------     DUBAI/ARABISCHE EMIRATE
      -                 '                                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 7 / SPALTENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG   DIR VB-NR.    NAME
      -                 '  VORNAME                EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 7 / GRUPPENKOPF 3:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     ERLEBNISREISE - RIVERRAFTING
      -                 ' IN ÖSTERREICH                             '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                 '                                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 7 / SPALTENKOPF 3:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG   DIR VB-NR.    NAME
      -                 '  VORNAME                EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 7 / GRUPPENKOPF 4:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               '  ANWÄRTER
      -                 '                                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 7 / SPALTENKOPF 4:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG   DIR VB-NR.    NAME
      -                 '  VORNAME                EINHEITEN GES.    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                NEUE VB    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *------------------------------------------------------------*
      *    * LISTE 8: WETTBEWERB LEBEN/UNFALL 1994                 *
      *------------------------------------------------------------*
      *    * LISTE 8: SEITENKOPF-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 8: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(100)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(030)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(100)        VALUE
200494*                         ' STAND: #DDDDDDDD#
200494                          ' STAND ABRECHNUNG: #DSTAT#
      -                        '
      -          '          SEITE: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(030)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(100)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(030)        VALUE SPACE.


      *    * LISTE 8 / GRUPPENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     TRAUMREISE IN DEN WESTEN DER
      -                        ' USA UND DEUTSCHLANDTREFFEN
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 8 / SPALTENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR. NAME                 VO
      -                        'RNAME         STUFE       EINHEITEN    E
      -          'INHEITEN     WERTUNGS-                              '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
110394-                        '                              LEBEN    U
110394-          'NFALL X 20   EINHEITEN                              '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 8 / GRUPPENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     ENTDECKUNGSREISE NACH DUBAI/
      -                        'ARABISCHE EMIRATE UND DEUTSCHLANDTREFFEN
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 8 / SPALTENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR. NAME                 VO
      -                        'RNAME         STUFE       EINHEITEN    E
      -          'INHEITEN     WERTUNGS-                              '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
110394-                        '                              LEBEN    U
110394-          'NFALL X 20   EINHEITEN                              '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 8 / GRUPPENKOPF 3:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     TOUR DER BESTEN DURCH EUROPA
      -                        'S SCHÖNSTE STÄDTE UND DEUTSCHLANDTREFFEN
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 8 / SPALTENKOPF 3:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR. NAME                 VO
      -                        'RNAME         STUFE       EINHEITEN    E
      -          'INHEITEN     WERTUNGS-                              '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
110394-                        '                              LEBEN    U
110394-          'NFALL X 20   EINHEITEN                              '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 8 / GRUPPENKOPF 4:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     DEUTSCHLANDTREFFEN
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 8 / SPALTENKOPF 4:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR. NAME                 VO
      -                        'RNAME         STUFE       EINHEITEN    E
      -          'INHEITEN     WERTUNGS-                              '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
110394-                        '                              LEBEN    U
110394-          'NFALL X 20   EINHEITEN                              '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 8 / GRUPPENKOPF 5:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'ANWÄRTER MIT WENIGER ALS #L8WE# WERTUNGS
      -                        'EINHEITEN
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 8 / SPALTENKOPF 5:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR. NAME                 VO
      -                        'RNAME         STUFE       EINHEITEN    E
      -          'INHEITEN     WERTUNGS-                              '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
110394-                        '                              LEBEN    U
110394-          'NFALL X 20   EINHEITEN                              '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

210394*** LISTE 9 UND LISTE 10 NEU, D.H. DIE NACHFOLGENDEN ZEILEN
      *------------------------------------------------------------*
      *    * LISTE 9: WETTBEWERB LEBEN 1994 (VILLA FLORES)         *
      *------------------------------------------------------------*
      *    * LISTE 9: SEITENKOPF-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 9: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(050)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(080)        VALUE
200494*                         ' STAND: #DDDDDDDD#
200494                          ' STAND ABRECHNUNG: #DSTAT#
      -                 '                              SEITE: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(050)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(050)        VALUE SPACE.


      *    * LISTE 9 / GRUPPENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     GELDPREIS DM 6.000,--
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 9 / SPALTENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR.  NAME                 V
      -                        'ORNAME          LV-NETTO-EINH.   VILLA
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '                   EIGEN NEUG.   FLORES
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.


      *    * LISTE 9 / GRUPPENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     GELDPREIS DM 5.000,--
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 9 / SPALTENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR.  NAME                 V
      -                        'ORNAME          LV-NETTO-EINH.   VILLA
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '                   EIGEN NEUG.   FLORES
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.


      *    * LISTE 9 / GRUPPENKOPF 3:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     GELDPREIS DM 4.000,--
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 9 / SPALTENKOPF 3:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR.  NAME                 V
      -                        'ORNAME          LV-NETTO-EINH.   VILLA
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '                   EIGEN NEUG.   FLORES
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.


      *    * LISTE 9 / GRUPPENKOPF 4:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     GELDPREIS DM 3.000,--
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 9 / SPALTENKOPF 4:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR.  NAME                 V
      -                        'ORNAME          LV-NETTO-EINH.   VILLA
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '                   EIGEN NEUG.   FLORES
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.


      *    * LISTE 9 / GRUPPENKOPF 5:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     GELDPREIS DM 2.000,--
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 9 / SPALTENKOPF 5:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR.  NAME                 V
      -                        'ORNAME          LV-NETTO-EINH.   VILLA
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '                   EIGEN NEUG.   FLORES
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.


      *    * LISTE 9 / GRUPPENKOPF 6:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     GELDPREIS DM 1.000,--
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 9 / SPALTENKOPF 6:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR.  NAME                 V
      -                        'ORNAME          LV-NETTO-EINH.   VILLA
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '                   EIGEN NEUG.   FLORES
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.


      *    * LISTE 9 / GRUPPENKOPF 7:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     DEUTSCHLANDTREFFEN
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 9 / SPALTENKOPF 7:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR.  NAME                 V
      -                        'ORNAME          LV-NETTO-EINH.   VILLA
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '                   EIGEN NEUG.   FLORES
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE   9.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.


      *------------------------------------------------------------*
      *    * LISTE10: WETTBEWERB LEBEN 1994 (VILLA FLORES)         *
      *------------------------------------------------------------*
      *    * LISTE10: SEITENKOPF-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE10: SEITENFUSS-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(050)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(080)        VALUE
200494*                         ' STAND: #DDDDDDDD#
200494                          ' STAND ABRECHNUNG: #DSTAT#
      -                 '                              SEITE: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(050)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(050)        VALUE SPACE.

      *    * LISTE10 / GRUPPENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     GELDPREIS DM 6.000,--
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE10 / SPALTENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR.  NAME                 V
      -                        'ORNAME          UV-NETTO-EINH.   VILLA
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '                   EIGEN NEUG.   FLORES
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.


      *    * LISTE10 / GRUPPENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     GELDPREIS DM 5.000,--
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE10 / SPALTENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR.  NAME                 V
      -                        'ORNAME          UV-NETTO-EINH.   VILLA
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '                   EIGEN NEUG.   FLORES
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.


      *    * LISTE 9 / GRUPPENKOPF 3:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     GELDPREIS DM 4.000,--
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE10 / SPALTENKOPF 3:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR.  NAME                 V
      -                        'ORNAME          UV-NETTO-EINH.   VILLA
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '                   EIGEN NEUG.   FLORES
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.


      *    * LISTE10 / GRUPPENKOPF 4:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     GELDPREIS DM 3.000,--
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE10 / SPALTENKOPF 4:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR.  NAME                 V
      -                        'ORNAME          UV-NETTO-EINH.   VILLA
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '                   EIGEN NEUG.   FLORES
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.


      *    * LISTE10 / GRUPPENKOPF 5:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     GELDPREIS DM 2.000,--
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE10 / SPALTENKOPF 5:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR.  NAME                 V
      -                        'ORNAME          UV-NETTO-EINH.   VILLA
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '                   EIGEN NEUG.   FLORES
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.


      *    * LISTE10 / GRUPPENKOPF 6:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     GELDPREIS DM 1.000,--
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE10 / SPALTENKOPF 6:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR.  NAME                 V
      -                        'ORNAME          UV-NETTO-EINH.   VILLA
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '                   EIGEN NEUG.   FLORES
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.


      *    * LISTE10 / GRUPPENKOPF 7:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINN:     DEUTSCHLANDTREFFEN
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '-------
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE10 / SPALTENKOPF 7:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR./VB-NR.  NAME                 V
      -                        'ORNAME          UV-NETTO-EINH.   VILLA
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '                   EIGEN NEUG.   FLORES
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  10.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

200296
200296*----------------------------------------------------------------*
200296*    * LISTE 11: WETTBEWERB 96 FÖRDERUNG NEUER VERMÖGENSBERATER
200296*----------------------------------------------------------------*
200296*    * LISTE 11: SEITENKOPF-ZEILEN
200296
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  11.
200296         10 FILLER              PIC  X(002)        VALUE 'SK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                 '                                           '.
200296
200296*    * LISTE 11: SEITENFUSS-ZEILEN
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  11.
200296         10 FILLER              PIC  X(002)        VALUE 'SF'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC  X(001)      VALUE     X'AC'.
200296         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
200296         10 FILLER              PIC  X(001)      VALUE     X'BC'.
200296         10 FILLER              PIC  X(050)        VALUE SPACE.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  11.
200296         10 FILLER              PIC  X(002)        VALUE 'SF'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   2.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(001)      VALUE     X'FA'.
200296         10 FILLER              PIC  X(080)        VALUE
200296                          ' STAND ABRECHNUNG: 01 - #DSTAT#
200296-                 '                              SEITE: #S# '.
200296         10 FILLER              PIC  X(001)      VALUE     X'FA'.
200296         10 FILLER              PIC  X(050)        VALUE SPACE.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  11.
200296         10 FILLER              PIC  X(002)        VALUE 'SF'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(001)      VALUE     X'AB'.
200296         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
200296         10 FILLER              PIC  X(001)      VALUE     X'BB'.
200296         10 FILLER              PIC  X(050)        VALUE SPACE.
200296
200296*    * LISTE 11/ GRUPPENKOPF 1:
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  11.
200296         10 FILLER              PIC  X(002)        VALUE 'GK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   2.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                 '                                           '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  11.
200296         10 FILLER              PIC  X(002)        VALUE 'GK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   2.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                 '                                           '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  11.
200296         10 FILLER              PIC  X(002)        VALUE 'GK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                 '                                           '.
200296
200296*    * LISTE 11/ SPALTENKOPF 1:
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  11.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         'RANG   DIR VB-NR.    NAME
200296-                 '  VORNAME                EINHEITEN GES.    '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  11.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   2.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                 '                                NEUE VB    '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  11.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                 '                                           '.
200296*----------------------------------------------------------------*
200296* WETTBEWERB ZUR FÖRDERUNG DER LEBENSVERSICHERUNG 1996 LISTE 12  *
200296*----------------------------------------------------------------*
200296*    * LISTE 12: SEITENKOPF-ZEILEN
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  12.
200296         10 FILLER              PIC  X(002)        VALUE 'SK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                 '                                           '.
200296
200296*    * LISTE 12: SEITENFUSS-ZEILEN
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  12.
200296         10 FILLER              PIC  X(002)        VALUE 'SF'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC  X(001)      VALUE     X'AC'.
200296         10 FILLER              PIC  X(100)      VALUE ALL X'BF'.
200296         10 FILLER              PIC  X(001)      VALUE     X'BC'.
200296         10 FILLER              PIC  X(030)        VALUE SPACE.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  12.
200296         10 FILLER              PIC  X(002)        VALUE 'SF'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   2.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(001)      VALUE     X'FA'.
200296         10 FILLER              PIC  X(100)        VALUE
200296                          ' STAND ABRECHNUNG: 01 - #DSTAT#
200296-                        '
200296-          '          SEITE: #S# '.
200296         10 FILLER              PIC  X(001)      VALUE     X'FA'.
200296         10 FILLER              PIC  X(030)        VALUE SPACE.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  12.
200296         10 FILLER              PIC  X(002)        VALUE 'SF'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(001)      VALUE     X'AB'.
200296         10 FILLER              PIC  X(100)      VALUE ALL X'BF'.
200296         10 FILLER              PIC  X(001)      VALUE     X'BB'.
200296         10 FILLER              PIC  X(030)        VALUE SPACE.
200296
200296
200296*    * LISTE 12/ GRUPPENKOPF 1:
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  12.
200296         10 FILLER              PIC  X(002)        VALUE 'GK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: ERLEBNISREISE NACH KANADA SOWIE
200296-                        '
200296-          '                                                    '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  12.
200296         10 FILLER              PIC  X(002)        VALUE 'GK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   2.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
240696                         '_______ MIT DEM DONAUDAMPFER NACH WIEN U
240696-                        'ND HOCKENHEIM-RING 1997
200296-          '                                                    '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  12.
200296         10 FILLER              PIC  X(002)        VALUE 'GK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                        '
200296-          '                                                    '.
240696*    * LISTE 12/ GRUPPENKOPF 2:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: SONDERREISE NACH MONZA SOWIE
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_______ MIT DEM DONAUDAMPFER NACH WIEN U
240696-                        'ND HOCKENHEIM-RING 1997
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 12/ GRUPPENKOPF 3:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: MIT DEM DONAUDAMPFER NACH WIEN U
240696-                        'ND HOCKENHEIM-RING 1997
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_______
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 12/ GRUPPENKOPF 4:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: MIT DEM DONAUDAMPFER NACH WIEN
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_______
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 12/ GRUPPENKOPF 5:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'ANWÄRTER:
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_________
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
200296*    * LISTE 12/ SPALTENKOPF 1:
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  12.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         'RANG DIR VB-NR   NAME                 VO
200296-                        'RNAME         STUFE    LV-NETTO-EH.   LV
V00296-          '-NETTO-EH.   WERTUNGS-                              '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  12.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   2.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                        '                       EIGEN NEUG.    EI
200296-          'GEN NEUG.    EINHEITEN                              '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  12.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                        '                       OHNE VM        MI
200296-          'T VM X 2                                            '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  12.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   4.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                        '
200296-          '                                                    '.
240696*    * LISTE 12/ SPALTENKOPF 2:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME         STUFE    LV-NETTO-EH.   LV
V00296-          '-NETTO-EH.   WERTUNGS-                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       EIGEN NEUG.    EI
240696-          'GEN NEUG.    EINHEITEN                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       OHNE VM        MI
240696-          'T VM X 2                                            '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 12/ SPALTENKOPF 3:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME         STUFE    LV-NETTO-EH.   LV
V00296-          '-NETTO-EH.   WERTUNGS-                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       EIGEN NEUG.    EI
240696-          'GEN NEUG.    EINHEITEN                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       OHNE VM        MI
240696-          'T VM X 2                                            '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 12/ SPALTENKOPF 4:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME         STUFE    LV-NETTO-EH.   LV
V00296-          '-NETTO-EH.   WERTUNGS-                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       EIGEN NEUG.    EI
240696-          'GEN NEUG.    EINHEITEN                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       OHNE VM        MI
240696-          'T VM X 2                                            '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 12/ SPALTENKOPF 5:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME         STUFE    LV-NETTO-EH.   LV
V00296-          '-NETTO-EH.   WERTUNGS-                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       EIGEN NEUG.    EI
240696-          'GEN NEUG.    EINHEITEN                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       OHNE VM        MI
240696-          'T VM X 2                                            '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  12.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
200296*----------------------------------------------------------------*
200296* WETTBEWERB ZUR FÖRDERUNG DER UNFALLVERSICHERUNG 1996 LISTE 13  *
200296*----------------------------------------------------------------*
200296*    * LISTE 13: SEITENKOPF-ZEILEN
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  13.
200296         10 FILLER              PIC  X(002)        VALUE 'SK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                 '                                           '.
200296
200296*    * LISTE 13: SEITENFUSS-ZEILEN
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  13.
200296         10 FILLER              PIC  X(002)        VALUE 'SF'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC  X(001)      VALUE     X'AC'.
200296         10 FILLER              PIC  X(100)      VALUE ALL X'BF'.
200296         10 FILLER              PIC  X(001)      VALUE     X'BC'.
200296         10 FILLER              PIC  X(030)        VALUE SPACE.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  13.
200296         10 FILLER              PIC  X(002)        VALUE 'SF'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   2.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(001)      VALUE     X'FA'.
200296         10 FILLER              PIC  X(100)        VALUE
200296                          ' STAND ABRECHNUNG: 01 - #DSTAT#
200296-                        '
200296-          '          SEITE: #S# '.
200296         10 FILLER              PIC  X(001)      VALUE     X'FA'.
200296         10 FILLER              PIC  X(030)        VALUE SPACE.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  13.
200296         10 FILLER              PIC  X(002)        VALUE 'SF'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(001)      VALUE     X'AB'.
200296         10 FILLER              PIC  X(100)      VALUE ALL X'BF'.
200296         10 FILLER              PIC  X(001)      VALUE     X'BB'.
200296         10 FILLER              PIC  X(030)        VALUE SPACE.
200296
200296
200296*    * LISTE 13/ GRUPPENKOPF 1:
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  13.
200296         10 FILLER              PIC  X(002)        VALUE 'GK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: ERLEBNISREISE NACH KANADA SOWIE
200296-                        '
200296-          '                                                    '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  13.
200296         10 FILLER              PIC  X(002)        VALUE 'GK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   2.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
240696                         '_______ MIT DEM DONAUDAMPFER NACH WIEN U
240696-                        'ND HOCKENHEIM-RING 1997
200296-          '                                                    '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  13.
200296         10 FILLER              PIC  X(002)        VALUE 'GK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                        '
200296-          '                                                    '.
240696*    * LISTE 13/ GRUPPENKOPF 2:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: SONDERREISE NACH MONZA SOWIE
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_______ MIT DEM DONAUDAMPFER NACH WIEN U
240696-                        'ND HOCKENHEIM-RING 1997
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 13/ GRUPPENKOPF 3:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: MIT DEM DONAUDAMPFER NACH WIEN U
240696-                        'ND HOCKENHEIM-RING 1997
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_______
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 13/ GRUPPENKOPF 4:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: MIT DEM DONAUDAMPFER NACH WIEN
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_______
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 13/ GRUPPENKOPF 5:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'ANWÄRTER:
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_________
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
200296
200296*    * LISTE 13/ SPALTENKOPF 1:
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  13.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         'RANG DIR VB-NR   NAME                 VO
200296-                        'RNAME         STUFE    UV-NETTO-EH.   UV
200296-          '-NETTO-EH.   WERTUNGS-                              '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  13.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   2.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                        '                       EIGEN NEUG.    EI
200296-          'GEN NEUG.    EINHEITEN                              '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  13.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                        '                       OHNE VM        MI
200296-          'T VM X 2                                            '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  13.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   4.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                        '
200296-          '                                                    '.
240696*    * LISTE 13/ SPALTENKOPF 2:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME         STUFE    UV-NETTO-EH.   UV
240696-          '-NETTO-EH.   WERTUNGS-                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       EIGEN NEUG.    EI
240696-          'GEN NEUG.    EINHEITEN                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       OHNE VM        MI
240696-          'T VM X 2                                            '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 13/ SPALTENKOPF 3:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME         STUFE    UV-NETTO-EH.   UV
240696-          '-NETTO-EH.   WERTUNGS-                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       EIGEN NEUG.    EI
240696-          'GEN NEUG.    EINHEITEN                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       OHNE VM        MI
240696-          'T VM X 2                                            '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 13/ SPALTENKOPF 4:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME         STUFE    UV-NETTO-EH.   UV
240696-          '-NETTO-EH.   WERTUNGS-                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       EIGEN NEUG.    EI
240696-          'GEN NEUG.    EINHEITEN                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       OHNE VM        MI
240696-          'T VM X 2                                            '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 13/ SPALTENKOPF 5:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME         STUFE    UV-NETTO-EH.   UV
240696-          '-NETTO-EH.   WERTUNGS-                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       EIGEN NEUG.    EI
240696-          'GEN NEUG.    EINHEITEN                              '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                       OHNE VM        MI
240696-          'T VM X 2                                            '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  13.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
200296*----------------------------------------------------------------*
200296* WETTBEWERB ZUR FÖRDERUNG NEUER VERMÖGENSBERATER 1996 LISTE 14  *
200296*----------------------------------------------------------------*
200296*    * LISTE 14: SEITENKOPF-ZEILEN
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  14.
200296         10 FILLER              PIC  X(002)        VALUE 'SK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                 '                                           '.
200296
200296*    * LISTE 14: SEITENFUSS-ZEILEN
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  14.
200296         10 FILLER              PIC  X(002)        VALUE 'SF'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC  X(001)      VALUE     X'AC'.
200296         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
200296         10 FILLER              PIC  X(001)      VALUE     X'BC'.
200296         10 FILLER              PIC  X(050)        VALUE SPACE.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  14.
200296         10 FILLER              PIC  X(002)        VALUE 'SF'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   2.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(001)      VALUE     X'FA'.
200296         10 FILLER              PIC  X(080)        VALUE
200296                          ' STAND ABRECHNUNG: 01 - #DSTAT#
200296-                 '                              SEITE: #S# '.
200296         10 FILLER              PIC  X(001)      VALUE     X'FA'.
200296         10 FILLER              PIC  X(050)        VALUE SPACE.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  14.
200296         10 FILLER              PIC  X(002)        VALUE 'SF'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(001)      VALUE     X'AB'.
200296         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
200296         10 FILLER              PIC  X(001)      VALUE     X'BB'.
200296         10 FILLER              PIC  X(050)        VALUE SPACE.
200296
200296
200296*    * LISTE 14/ GRUPPENKOPF 1:
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  14.
200296         10 FILLER              PIC  X(002)        VALUE 'GK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: ERLEBNISREISE NACH KANADA UND MI
200296-                        'T DEM DONAUDAMPFER NACH WIEN SOWIE
200296-          '                                                    '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  14.
200296         10 FILLER              PIC  X(002)        VALUE 'GK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   2.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '_______ HOCKENHEIM-RING 1997 UND DVAG-KA
200296-                        'RTFESTIVAL 1997
200296-          '                                                    '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  14.
200296         10 FILLER              PIC  X(002)        VALUE 'GK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                        '
200296-          '                                                    '.
240696*    * LISTE 14/ GRUPPENKOPF 2:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: SONDERREISE NACH MONZA UND MIT D
240696-                        'EM DONAUDAMPFER NACH WIEN SOWIE
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_______ HOCKENHEIM-RING 1997 UND DVAG-KA
240696-                        'RTFESTIVAL 1997
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 14/ GRUPPENKOPF 3:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: MIT DEM DONAUDAMPFER NACH WIEN S
240696-                        'OWIE
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_______ HOCKENHEIM-RING 1997 UND DVAG-KA
240696-                        'RTFESTIVAL 1997
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 14/ GRUPPENKOPF 4:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'ANWÄRTER:
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_________
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
200296
200296*    * LISTE 14/ SPALTENKOPF 1:
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  14.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         'RANG DIR VB-NR   NAME                 VO
200296-                        'RNAME       STUFE   ANZAHL      EINHEITE
200296-          'N                                                   '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  14.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   2.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                        '                    NEUE VB   GES. NEUE
200296-          'VB                                                  '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  14.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   3.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                        '
200296-          '                                                    '.
200296     05  FILLER.
200296         10 FILLER              PIC S9(004) COMP   VALUE  14.
200296         10 FILLER              PIC  X(002)        VALUE 'PK'.
200296         10 FILLER              PIC S9(004) COMP   VALUE   1.
200296         10 FILLER              PIC S9(004) COMP   VALUE   4.
200296         10 FILLER              PIC S9(004) COMP   VALUE   0.
200296         10 FILLER              PIC  X(132)        VALUE
200296                         '
200296-                        '
200296-          '                                                    '.
240696*    * LISTE 14/ SPALTENKOPF 2:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME       STUFE   ANZAHL      EINHEITE
240696-          'N                                                   '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                    NEUE VB   GES. NEUE
240696-          'VB                                                  '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 14/ SPALTENKOPF 3:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME       STUFE   ANZAHL      EINHEITE
240696-          'N                                                   '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                    NEUE VB   GES. NEUE
240696-          'VB                                                  '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 14/ SPALTENKOPF 4:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME       STUFE   ANZAHL      EINHEITE
240696-          'N                                                   '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '                    NEUE VB   GES. NEUE
240696-          'VB                                                  '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  14.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
010496*----------------------------------------------------------------*
010496* ZIELWETTBEWERB FÜR DIREKTIONSLEITER 1996 LISTE 15
010496*----------------------------------------------------------------*
010496*    * LISTE 15: SEITENKOPF-ZEILEN
010496     05  FILLER.
010496         10 FILLER              PIC S9(004) COMP   VALUE  15.
010496         10 FILLER              PIC  X(002)        VALUE 'SK'.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC S9(004) COMP   VALUE   3.
010496         10 FILLER              PIC  X(132)        VALUE
010496                         '
010496-                 '                                           '.
010496
010496*    * LISTE 15: SEITENFUSS-ZEILEN
010496     05  FILLER.
010496         10 FILLER              PIC S9(004) COMP   VALUE  15.
010496         10 FILLER              PIC  X(002)        VALUE 'SF'.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC  X(001)      VALUE     X'AC'.
010496         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
010496         10 FILLER              PIC  X(001)      VALUE     X'BC'.
010496         10 FILLER              PIC  X(050)        VALUE SPACE.
010496     05  FILLER.
010496         10 FILLER              PIC S9(004) COMP   VALUE  15.
010496         10 FILLER              PIC  X(002)        VALUE 'SF'.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC S9(004) COMP   VALUE   2.
010496         10 FILLER              PIC S9(004) COMP   VALUE   0.
010496         10 FILLER              PIC  X(001)      VALUE     X'FA'.
010496         10 FILLER              PIC  X(080)        VALUE
010496                          ' STAND ABRECHNUNG: 01 - #DSTAT#
010496-                 '                              SEITE: #S# '.
010496         10 FILLER              PIC  X(001)      VALUE     X'FA'.
010496         10 FILLER              PIC  X(050)        VALUE SPACE.
010496     05  FILLER.
010496         10 FILLER              PIC S9(004) COMP   VALUE  15.
010496         10 FILLER              PIC  X(002)        VALUE 'SF'.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC S9(004) COMP   VALUE   3.
010496         10 FILLER              PIC S9(004) COMP   VALUE   0.
010496         10 FILLER              PIC  X(001)      VALUE     X'AB'.
010496         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
010496         10 FILLER              PIC  X(001)      VALUE     X'BB'.
010496         10 FILLER              PIC  X(050)        VALUE SPACE.
010496
010496
010496*    * LISTE 15/ GRUPPENKOPF 1:
010496     05  FILLER.
010496         10 FILLER              PIC S9(004) COMP   VALUE  15.
010496         10 FILLER              PIC  X(002)        VALUE 'GK'.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: TRAUMREISE NACH ARGENTINIEN, FLO
240696-                        'RIDA SOWIE
010496-          '                                                    '.
010496     05  FILLER.
010496         10 FILLER              PIC S9(004) COMP   VALUE  15.
010496         10 FILLER              PIC  X(002)        VALUE 'GK'.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC S9(004) COMP   VALUE   2.
010496         10 FILLER              PIC S9(004) COMP   VALUE   0.
010496         10 FILLER              PIC  X(132)        VALUE
240696                         '_______ HOCKENHEIM-RING 1997 UND DVAG-ME
010496-                        'GA-LINER
010496-          '                                                    '.
010496     05  FILLER.
010496         10 FILLER              PIC S9(004) COMP   VALUE  15.
010496         10 FILLER              PIC  X(002)        VALUE 'GK'.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC S9(004) COMP   VALUE   3.
010496         10 FILLER              PIC S9(004) COMP   VALUE   0.
010496         10 FILLER              PIC  X(132)        VALUE
240696                         '
010496-                        '
010496-          '                                                    '.
240696*    * LISTE 15/ GRUPPENKOPF 2:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: SUPERREISE NACH MAROKKO SOWIE
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_______ HOCKENHEIM-RING 1997 UND DVAG-ME
240696-                        'GA-LINER
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696
240696*    * LISTE 15/ GRUPPENKOPF 3:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: ENTDECKUNGSREISE NACH IRLAND SOW
240696-                        'IE
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_______ HOCKENHEIM-RING 1997 UND DVAG-ME
240696-                        'GA-LINER
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696
240696*    * LISTE 15/ GRUPPENKOPF 4:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'GEWINN: HOCKENHEIM-RING 1997 UND DVAG-ME
240696-                        'GA-LINER
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_______
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 15/ GRUPPENKOPF 5:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'ANWÄRTER:
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '_________
240696-                        '
240696-          '                                                    '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'GK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
010496*    * LISTE 15/ SPALTENKOPF 1:
010496     05  FILLER.
010496         10 FILLER              PIC S9(004) COMP   VALUE  15.
010496         10 FILLER              PIC  X(002)        VALUE 'PK'.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC S9(004) COMP   VALUE   0.
010496         10 FILLER              PIC  X(132)        VALUE
010496                         'RANG DIR VB-NR   NAME                 VO
010496-                        'RNAME       MONATSZIEL EINH. NEUG.  PROZ
010496-          '.                                                   '.
010496     05  FILLER.
010496         10 FILLER              PIC S9(004) COMP   VALUE  15.
010496         10 FILLER              PIC  X(002)        VALUE 'PK'.
010496         10 FILLER              PIC S9(004) COMP   VALUE   1.
010496         10 FILLER              PIC S9(004) COMP   VALUE   2.
010496         10 FILLER              PIC S9(004) COMP   VALUE   0.
010496         10 FILLER              PIC  X(132)        VALUE
010496                         '
010496-                        '
010496-          '                                                    '.
240696*    * LISTE 15/ SPALTENKOPF 2:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME       MONATSZIEL EINH. NEUG.  PROZ
240696-          '.                                                   '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 15/ SPALTENKOPF 3:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME       MONATSZIEL EINH. NEUG.  PROZ
240696-          '.                                                   '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   3.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 15/ SPALTENKOPF 4:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME       MONATSZIEL EINH. NEUG.  PROZ
240696-          '.                                                   '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   4.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240696*    * LISTE 15/ SPALTENKOPF 5:
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   1.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         'RANG DIR VB-NR   NAME                 VO
240696-                        'RNAME       MONATSZIEL EINH. NEUG.  PROZ
240696-          '.                                                   '.
240696     05  FILLER.
240696         10 FILLER              PIC S9(004) COMP   VALUE  15.
240696         10 FILLER              PIC  X(002)        VALUE 'PK'.
240696         10 FILLER              PIC S9(004) COMP   VALUE   5.
240696         10 FILLER              PIC S9(004) COMP   VALUE   2.
240696         10 FILLER              PIC S9(004) COMP   VALUE   0.
240696         10 FILLER              PIC  X(132)        VALUE
240696                         '
240696-                        '
240696-          '                                                    '.
240297
240297*----------------------------------------------------------------*
240297*    * LISTE 16: ZIELWETTBEWERT 1997 RGS - D
240297*----------------------------------------------------------------*
240297*    * LISTE 16: SEITENKOPF-ZEILEN
240297
240297     05  FILLER.
240297         10 FILLER              PIC S9(004) COMP   VALUE  16.
240297         10 FILLER              PIC  X(002)        VALUE 'SK'.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   3.
240297         10 FILLER              PIC  X(132)        VALUE
240297                         '
240297-                 '                                           '.
240297
240297*    * LISTE 16: SEITENFUSS-ZEILEN
240297     05  FILLER.
240297         10 FILLER              PIC S9(004) COMP   VALUE  16.
240297         10 FILLER              PIC  X(002)        VALUE 'SF'.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC  X(001)      VALUE     X'AC'.
240297         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
240297         10 FILLER              PIC  X(001)      VALUE     X'BC'.
240297         10 FILLER              PIC  X(050)        VALUE SPACE.
240297     05  FILLER.
240297         10 FILLER              PIC S9(004) COMP   VALUE  16.
240297         10 FILLER              PIC  X(002)        VALUE 'SF'.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   2.
240297         10 FILLER              PIC S9(004) COMP   VALUE   0.
240297         10 FILLER              PIC  X(001)      VALUE     X'FA'.
240297         10 FILLER              PIC  X(080)        VALUE
240297                          ' STAND ABRECHNUNG: 01 - #DSTAT#
240297-                 '                              SEITE: #S# '.
240297         10 FILLER              PIC  X(001)      VALUE     X'FA'.
240297         10 FILLER              PIC  X(050)        VALUE SPACE.
240297     05  FILLER.
240297         10 FILLER              PIC S9(004) COMP   VALUE  16.
240297         10 FILLER              PIC  X(002)        VALUE 'SF'.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   3.
240297         10 FILLER              PIC S9(004) COMP   VALUE   0.
240297         10 FILLER              PIC  X(001)      VALUE     X'AB'.
240297         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
240297         10 FILLER              PIC  X(001)      VALUE     X'BB'.
240297         10 FILLER              PIC  X(050)        VALUE SPACE.
240297
240297*    * LISTE 16/ GRUPPENKOPF 1: ENTFÄLLT
240297
010497*    * LISTE 16/ GRUPPENKOPF 2: ANWÄRTER
010497     05  FILLER.
010497         10 FILLER              PIC S9(004) COMP   VALUE  16.
010497         10 FILLER              PIC  X(002)        VALUE 'GK'.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   1.
010497         10 FILLER              PIC S9(004) COMP   VALUE   1.
010497         10 FILLER              PIC  X(132)        VALUE
010497                         'ANWÄRTER:
010497-                        '
010497-          '                                                    '.
010497     05  FILLER.
010497         10 FILLER              PIC S9(004) COMP   VALUE  16.
010497         10 FILLER              PIC  X(002)        VALUE 'GK'.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   0.
010497         10 FILLER              PIC  X(132)        VALUE
010497                         '_________
010497-                        '
010497-          '                                                    '.
010497     05  FILLER.
010497         10 FILLER              PIC S9(004) COMP   VALUE  16.
010497         10 FILLER              PIC  X(002)        VALUE 'GK'.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   3.
010497         10 FILLER              PIC S9(004) COMP   VALUE   0.
010497         10 FILLER              PIC  X(132)        VALUE
010497                         '
010497-                        '
010497-          '                                                    '.
240297*    * LISTE 16/ SPALTENKOPF 1:
240297     05  FILLER.
240297         10 FILLER              PIC S9(004) COMP   VALUE  16.
240297         10 FILLER              PIC  X(002)        VALUE 'PK'.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   0.
240297         10 FILLER              PIC  X(132)        VALUE
240297                         'RANG DIR VB-NR   NAME            VORNAME
240297-                 '   EINH. NEUG.  STEIG.96   UMSATZ-  WETTB. '.
240297     05  FILLER.
240297         10 FILLER              PIC S9(004) COMP   VALUE  16.
240297         10 FILLER              PIC  X(002)        VALUE 'PK'.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   2.
240297         10 FILLER              PIC S9(004) COMP   VALUE   0.
240297         10 FILLER              PIC  X(132)        VALUE
240297                         '
240297-                 '                  IN %        ZIEL   IN %  '.
240297     05  FILLER.
240297         10 FILLER              PIC S9(004) COMP   VALUE  16.
240297         10 FILLER              PIC  X(002)        VALUE 'PK'.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   3.
240297         10 FILLER              PIC S9(004) COMP   VALUE   0.
240297         10 FILLER              PIC  X(132)        VALUE
240297                         '
240297-                 '                                           '.
010497*    * LISTE 16/ SPALTENKOPF 2:
010497     05  FILLER.
010497         10 FILLER              PIC S9(004) COMP   VALUE  16.
010497         10 FILLER              PIC  X(002)        VALUE 'PK'.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   1.
010497         10 FILLER              PIC S9(004) COMP   VALUE   0.
010497         10 FILLER              PIC  X(132)        VALUE
010497                         'RANG DIR VB-NR   NAME            VORNAME
010497-                 '   EINH. NEUG.  STEIG.96   UMSATZ-  WETTB. '.
010497     05  FILLER.
010497         10 FILLER              PIC S9(004) COMP   VALUE  16.
010497         10 FILLER              PIC  X(002)        VALUE 'PK'.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   0.
010497         10 FILLER              PIC  X(132)        VALUE
010497                         '
010497-                 '                  IN %        ZIEL   IN %  '.
010497     05  FILLER.
010497         10 FILLER              PIC S9(004) COMP   VALUE  16.
010497         10 FILLER              PIC  X(002)        VALUE 'PK'.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   3.
010497         10 FILLER              PIC S9(004) COMP   VALUE   0.
010497         10 FILLER              PIC  X(132)        VALUE
010497                         '
010497-                 '                                           '.
240297*----------------------------------------------------------------*
240297*    * LISTE 17: WETTBEWERB 1997 LEBENSVERSICHERUNG
240297*----------------------------------------------------------------*
240297*    * LISTE 17: SEITENKOPF-ZEILEN
240297
240297     05  FILLER.
240297         10 FILLER              PIC S9(004) COMP   VALUE  17.
240297         10 FILLER              PIC  X(002)        VALUE 'SK'.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   3.
240297         10 FILLER              PIC  X(132)        VALUE
240297                         '
240297-                 '                                           '.
240297
240297*    * LISTE 17: SEITENFUSS-ZEILEN
240297     05  FILLER.
240297         10 FILLER              PIC S9(004) COMP   VALUE  17.
240297         10 FILLER              PIC  X(002)        VALUE 'SF'.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC  X(001)      VALUE     X'AC'.
240297         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
240297         10 FILLER              PIC  X(001)      VALUE     X'BC'.
240297         10 FILLER              PIC  X(050)        VALUE SPACE.
240297     05  FILLER.
240297         10 FILLER              PIC S9(004) COMP   VALUE  17.
240297         10 FILLER              PIC  X(002)        VALUE 'SF'.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   2.
240297         10 FILLER              PIC S9(004) COMP   VALUE   0.
240297         10 FILLER              PIC  X(001)      VALUE     X'FA'.
240297         10 FILLER              PIC  X(080)        VALUE
240297                          ' STAND ABRECHNUNG: 10/1996 - #DSTAT#
240297-                 '                              SEITE: #S# '.
240297         10 FILLER              PIC  X(001)      VALUE     X'FA'.
240297         10 FILLER              PIC  X(050)        VALUE SPACE.
240297     05  FILLER.
240297         10 FILLER              PIC S9(004) COMP   VALUE  17.
240297         10 FILLER              PIC  X(002)        VALUE 'SF'.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   3.
240297         10 FILLER              PIC S9(004) COMP   VALUE   0.
240297         10 FILLER              PIC  X(001)      VALUE     X'AB'.
240297         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
240297         10 FILLER              PIC  X(001)      VALUE     X'BB'.
240297         10 FILLER              PIC  X(050)        VALUE SPACE.
240297
240297*    * LISTE 17/ GRUPPENKOPF 1: ENTFÄLLT
240297
010497*    * LISTE 17/ GRUPPENKOPF 2: ANWÄRTER
010497     05  FILLER.
010497         10 FILLER              PIC S9(004) COMP   VALUE  17.
010497         10 FILLER              PIC  X(002)        VALUE 'GK'.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   1.
010497         10 FILLER              PIC S9(004) COMP   VALUE   1.
010497         10 FILLER              PIC  X(132)        VALUE
010497                         'ANWÄRTER:
010497-                        '
010497-          '                                                    '.
010497     05  FILLER.
010497         10 FILLER              PIC S9(004) COMP   VALUE  17.
010497         10 FILLER              PIC  X(002)        VALUE 'GK'.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   0.
010497         10 FILLER              PIC  X(132)        VALUE
010497                         '_________
010497-                        '
010497-          '                                                    '.
010497     05  FILLER.
010497         10 FILLER              PIC S9(004) COMP   VALUE  17.
010497         10 FILLER              PIC  X(002)        VALUE 'GK'.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   3.
010497         10 FILLER              PIC S9(004) COMP   VALUE   0.
010497         10 FILLER              PIC  X(132)        VALUE
010497                         '
010497-                        '
010497-          '                                                    '.
240297*    * LISTE 17/ SPALTENKOPF 1:
240297     05  FILLER.
240297         10 FILLER              PIC S9(004) COMP   VALUE  17.
240297         10 FILLER              PIC  X(002)        VALUE 'PK'.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   0.
240297         10 FILLER              PIC  X(132)        VALUE
240297                         'RANG DIR VB-NR   NAME            VORNAME
240297-         '  STUFE     LV-NETTO-EINH. EIGEN NEUG.               '.
240297     05  FILLER.
240297         10 FILLER              PIC S9(004) COMP   VALUE  17.
240297         10 FILLER              PIC  X(002)        VALUE 'PK'.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   2.
240297         10 FILLER              PIC S9(004) COMP   VALUE   0.
240297         10 FILLER              PIC  X(132)        VALUE
240297                         '
240297-         '          VORMONATE  LFND. MONAT   GESAMT            '.
240297     05  FILLER.
240297         10 FILLER              PIC S9(004) COMP   VALUE  17.
240297         10 FILLER              PIC  X(002)        VALUE 'PK'.
240297         10 FILLER              PIC S9(004) COMP   VALUE   1.
240297         10 FILLER              PIC S9(004) COMP   VALUE   3.
240297         10 FILLER              PIC S9(004) COMP   VALUE   0.
240297         10 FILLER              PIC  X(132)        VALUE
240297                         '
240297-         '                                                     '.
010497*    * LISTE 17/ SPALTENKOPF 2:
010497     05  FILLER.
010497         10 FILLER              PIC S9(004) COMP   VALUE  17.
010497         10 FILLER              PIC  X(002)        VALUE 'PK'.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   1.
010497         10 FILLER              PIC S9(004) COMP   VALUE   0.
010497         10 FILLER              PIC  X(132)        VALUE
010497                         'RANG DIR VB-NR   NAME            VORNAME
010497-         '  STUFE     LV-NETTO-EINH. EIGEN NEUG.               '.
010497     05  FILLER.
010497         10 FILLER              PIC S9(004) COMP   VALUE  17.
010497         10 FILLER              PIC  X(002)        VALUE 'PK'.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   0.
010497         10 FILLER              PIC  X(132)        VALUE
010497                         '
010497-         '          VORMONATE  LFND. MONAT   GESAMT            '.
010497     05  FILLER.
010497         10 FILLER              PIC S9(004) COMP   VALUE  17.
010497         10 FILLER              PIC  X(002)        VALUE 'PK'.
010497         10 FILLER              PIC S9(004) COMP   VALUE   2.
010497         10 FILLER              PIC S9(004) COMP   VALUE   3.
010497         10 FILLER              PIC S9(004) COMP   VALUE   0.
010497         10 FILLER              PIC  X(132)        VALUE
010497                         '
010497-         '                                                     '.
220198*----------------------------------------------------------------*
220198*    * LISTE 18: ZIELWETTBEWERB 1998 RGS - D
220198*----------------------------------------------------------------*
220198*    * LISTE 18: SEITENKOPF-ZEILEN
220198
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'SK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                                           '.
220198
220198*    * LISTE 18: SEITENFUSS-ZEILEN
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(001)      VALUE     X'AC'.
220198         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
220198         10 FILLER              PIC  X(001)      VALUE     X'BC'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(001)      VALUE     X'FA'.
220198         10 FILLER              PIC  X(080)        VALUE
220198                          ' STAND ABRECHNUNG: 01 - #DSTAT#
220198-                 '                              SEITE: #S# '.
220198         10 FILLER              PIC  X(001)      VALUE     X'FA'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(001)      VALUE     X'AB'.
220198         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
220198         10 FILLER              PIC  X(001)      VALUE     X'BB'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198
220198*    * LISTE 18/ GRUPPENKOPF 1: GEWINNER + HOCKENHEIM 98
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'GEWINNER: "GEMEINSAM DIE WELT ENTDECKEN"
220198-                        ' UND HOCKENHEIM 98
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '_________
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                        '
220198-          '                                                    '.
220198
220198*    * LISTE 18/ GRUPPENKOPF 2: GEWINNER
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'GEWINNER: "GEMEINSAM DIE WELT ENTDECKEN"
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '_________
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                        '
220198-          '                                                    '.
220198*    * LISTE 18/ GRUPPENKOPF 3: ANWÄRTER
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'ANWÄRTER:
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '_________
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                        '
220198-          '                                                    '.
220198*    * LISTE 18/ SPALTENKOPF 1:
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'RANG DIR VB-NR   NAME            VORNAME
220198-                 '   EINH. NEUG.  STEIG.97   UMSATZ-  WETTB. '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                  IN %        ZIEL   IN %  '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                                           '.
220198*    * LISTE 18/ SPALTENKOPF 2:
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'RANG DIR VB-NR   NAME            VORNAME
220198-                 '   EINH. NEUG.  STEIG.97   UMSATZ-  WETTB. '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                  IN %        ZIEL   IN %  '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                                           '.
220198*    * LISTE 18/ SPALTENKOPF 3:
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'RANG DIR VB-NR   NAME            VORNAME
220198-                 '   EINH. NEUG.  STEIG.97   UMSATZ-  WETTB. '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                  IN %        ZIEL   IN %  '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  18.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                                           '.
220198*----------------------------------------------------------------*
220198*    * LISTE 19: ZIELWETTBEWERB 1998 RGS - D
220198*----------------------------------------------------------------*
220198*    * LISTE 19: SEITENKOPF-ZEILEN
220198
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'SK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                                           '.
220198
220198*    * LISTE 19: SEITENFUSS-ZEILEN
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(001)      VALUE     X'AC'.
220198         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
220198         10 FILLER              PIC  X(001)      VALUE     X'BC'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(001)      VALUE     X'FA'.
220198         10 FILLER              PIC  X(080)        VALUE
220198                          ' STAND ABRECHNUNG: 01 - #DSTAT#
220198-                 '                              SEITE: #S# '.
220198         10 FILLER              PIC  X(001)      VALUE     X'FA'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(001)      VALUE     X'AB'.
220198         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
220198         10 FILLER              PIC  X(001)      VALUE     X'BB'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198
220198*    * LISTE 19/ GRUPPENKOPF 1: GEWINNER + HOCKENHEIM 98
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'GEWINNER: "GEMEINSAM DIE WELT ENTDECKEN"
220198-                        ' UND HOCKENHEIM 98
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '_________
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                        '
220198-          '                                                    '.
220198
220198*    * LISTE 19/ GRUPPENKOPF 2: GEWINNER
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'GEWINNER: HOCKENHEIM 98
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '_________
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                        '
220198-          '                                                    '.
220198*    * LISTE 19/ GRUPPENKOPF 3: ANWÄRTER
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'ANWÄRTER:
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '_________
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                        '
220198-          '                                                    '.
220198*    * LISTE 19/ SPALTENKOPF 1:
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'RANG DIR VB-NR   NAME            VORNAME
220198-                 '   EINH. NEUG.  STEIG.97   UMSATZ-  WETTB. '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                  IN %        ZIEL   IN %  '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                                           '.
220198*    * LISTE 19/ SPALTENKOPF 2:
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'RANG DIR VB-NR   NAME            VORNAME
220198-                 '   EINH. NEUG.  STEIG.97   UMSATZ-  WETTB. '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                  IN %        ZIEL   IN %  '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                                           '.
220198*    * LISTE 19/ SPALTENKOPF 3:
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'RANG DIR VB-NR   NAME            VORNAME
220198-                 '   EINH. NEUG.  STEIG.97   UMSATZ-  WETTB. '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                  IN %        ZIEL   IN %  '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  19.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                                           '.
220198*----------------------------------------------------------------*
220198*    * LISTE 19: ZIELWETTBEWERB 2098 RGS - D
220198*----------------------------------------------------------------*
220198*    * LISTE 20: SEITENKOPF-ZEILEN
220198
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'SK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                                           '.
220198
220198*    * LISTE 20: SEITENFUSS-ZEILEN
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(001)      VALUE     X'AC'.
220198         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
220198         10 FILLER              PIC  X(001)      VALUE     X'BC'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(001)      VALUE     X'FA'.
220198         10 FILLER              PIC  X(080)        VALUE
220198                          ' STAND ABRECHNUNG: 01 - #DSTAT#
220198-                 '                              SEITE: #S# '.
220198         10 FILLER              PIC  X(001)      VALUE     X'FA'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(001)      VALUE     X'AB'.
220198         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
220198         10 FILLER              PIC  X(001)      VALUE     X'BB'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198
220198*    * LISTE 20/ GRUPPENKOPF 1: GEWINNER
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'GEWINNER: "GEMEINSAM DIE WELT ENTDECKEN"
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '_________
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                        '
220198-          '                                                    '.
220198
220198*    * LISTE 20/ GRUPPENKOPF 2: ANWÄRTER
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'ANWÄRTER:
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '_________
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                        '
220198-          '                                                    '.
220198*    * LISTE 20/ SPALTENKOPF 1:
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'RANG DIR VB-NR   NAME            VORNAME
220198-                 '   EINH. NEUG.  STEIG.97   UMSATZ-  WETTB. '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                  IN %        ZIEL   IN %  '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                                           '.
220198*    * LISTE 20/ SPALTENKOPF 2:
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'RANG DIR VB-NR   NAME            VORNAME
220198-                 '   EINH. NEUG.  STEIG.97   UMSATZ-  WETTB. '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                  IN %        ZIEL   IN %  '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  20.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                                           '.
220198*----------------------------------------------------------------*
220198*    * LISTE 21: WETTBEWERB 1998 LEBENSVERSICHERUNG
220198*----------------------------------------------------------------*
220198*    * LISTE 21: SEITENKOPF-ZEILEN
220198
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'SK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                                           '.
220198
220198*    * LISTE 21: SEITENFUSS-ZEILEN
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(001)      VALUE     X'AC'.
220198         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
220198         10 FILLER              PIC  X(001)      VALUE     X'BC'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(001)      VALUE     X'FA'.
220198         10 FILLER              PIC  X(080)        VALUE
220198                          ' STAND ABRECHNUNG: 01/1998 - #DSTAT#
220198-                 '                              SEITE: #S# '.
220198         10 FILLER              PIC  X(001)      VALUE     X'FA'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(001)      VALUE     X'AB'.
220198         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
220198         10 FILLER              PIC  X(001)      VALUE     X'BB'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198
220198*    * LISTE 21/ GRUPPENKOPF 1: GEWINNER + HOCKENHEIM
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'GEWINNER: "GEMEINSAM DIE WELT ENTDECKEN"
220198-                        ' UND HOCKENHEIM 98
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '_________
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                        '
220198-          '                                                    '.
220198
220198*    * LISTE 21/ GRUPPENKOPF 2: GEMEINSAM...
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'GEWINNER: "GEMEINSAM DIE WELT ENTDECKEN"
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '_________
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                        '
220198-          '                                                    '.
220198*    * LISTE 21/ GRUPPENKOPF 3: ANWÄRTER
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'ANWÄRTER:
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '_________
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                        '
220198-          '                                                    '.
220198*    * LISTE 21/ SPALTENKOPF 1:
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'RANG DIR VB-NR   NAME            VORNAME
220198-         '  STUFE     LV-NETTO-EINH. EIGEN NEUG.               '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-         '          VORMONATE  LFND. MONAT   GESAMT            '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-         '                                                     '.
220198*    * LISTE 21/ SPALTENKOPF 2:
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'RANG DIR VB-NR   NAME            VORNAME
220198-         '  STUFE     LV-NETTO-EINH. EIGEN NEUG.               '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-         '          VORMONATE  LFND. MONAT   GESAMT            '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-         '                                                     '.
220198*    * LISTE 21/ SPALTENKOPF 3:
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'RANG DIR VB-NR   NAME            VORNAME
220198-         '  STUFE     LV-NETTO-EINH. EIGEN NEUG.               '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-         '          VORMONATE  LFND. MONAT   GESAMT            '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  21.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-         '                                                     '.
220198*----------------------------------------------------------------*
220198*    * LISTE 22: WETTBEWERB 1998 LEBENSVERSICHERUNG
220198*----------------------------------------------------------------*
220198*    * LISTE 22: SEITENKOPF-ZEILEN
220198
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'SK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                 '                                           '.
220198
220198*    * LISTE 22: SEITENFUSS-ZEILEN
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(001)      VALUE     X'AC'.
220198         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
220198         10 FILLER              PIC  X(001)      VALUE     X'BC'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(001)      VALUE     X'FA'.
220198         10 FILLER              PIC  X(080)        VALUE
220198                          ' STAND ABRECHNUNG: 01/1998 - #DSTAT#
220198-                 '                              SEITE: #S# '.
220198         10 FILLER              PIC  X(001)      VALUE     X'FA'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'SF'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(001)      VALUE     X'AB'.
220198         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
220198         10 FILLER              PIC  X(001)      VALUE     X'BB'.
220198         10 FILLER              PIC  X(050)        VALUE SPACE.
220198
220198*    * LISTE 22/ GRUPPENKOPF 1: GEWINNER
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'GEWINNER: "GEMEINSAM DIE WELT ENTDECKEN"
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '_________
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                        '
220198-          '                                                    '.
220198
220198
220198*    * LISTE 22/ GRUPPENKOPF 2: ANWÄRTER
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'ANWÄRTER:
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '_________
220198-                        '
220198-          '                                                    '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'GK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-                        '
220198-          '                                                    '.
220198*    * LISTE 22/ SPALTENKOPF 1:
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'RANG DIR VB-NR   NAME            VORNAME
220198-         '  STUFE     LV-NETTO-EINH. EIGEN NEUG.               '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-         '          VORMONATE  LFND. MONAT   GESAMT            '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-         '                                                     '.
220198*    * LISTE 22/ SPALTENKOPF 2:
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   1.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         'RANG DIR VB-NR   NAME            VORNAME
220198-         '  STUFE     LV-NETTO-EINH. EIGEN NEUG.               '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-         '          VORMONATE  LFND. MONAT   GESAMT            '.
220198     05  FILLER.
220198         10 FILLER              PIC S9(004) COMP   VALUE  22.
220198         10 FILLER              PIC  X(002)        VALUE 'PK'.
220198         10 FILLER              PIC S9(004) COMP   VALUE   2.
220198         10 FILLER              PIC S9(004) COMP   VALUE   3.
220198         10 FILLER              PIC S9(004) COMP   VALUE   0.
220198         10 FILLER              PIC  X(132)        VALUE
220198                         '
220198-         '                                                     '.

120192*----------------------------------------------------------------*
120199*    * LISTE 23: WETTBEWERB 1999 LEBENSVERSICHERUNG
120199*----------------------------------------------------------------*
120199*    * LISTE 23: SEITENKOPF-ZEILEN
120199
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'SK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   3.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '
120199-                 '                                           '.
120199
120199*    * LISTE 23: SEITENFUSS-ZEILEN
290399     05  FILLER.
290399         10 FILLER              PIC S9(004) COMP   VALUE  23.
290399         10 FILLER              PIC  X(002)        VALUE 'SF'.
290399         10 FILLER              PIC S9(004) COMP   VALUE   1.
290399         10 FILLER              PIC S9(004) COMP   VALUE   1.
290399         10 FILLER              PIC S9(004) COMP   VALUE   1.
290399         10 FILLER              PIC  X(132)        VALUE
290399                         'ANM.: DER WETTBEWERB KANN NUR VON VERMÖG
290399-         'ENSBERATERN GEWONNEN WERDEN, DIE EINEN EQF           '.
290399     05  FILLER.
290399         10 FILLER              PIC S9(004) COMP   VALUE  23.
290399         10 FILLER              PIC  X(002)        VALUE 'SF'.
290399         10 FILLER              PIC S9(004) COMP   VALUE   1.
290399         10 FILLER              PIC S9(004) COMP   VALUE   2.
290399         10 FILLER              PIC S9(004) COMP   VALUE   0.
290399         10 FILLER              PIC  X(132)        VALUE
290399                         '      VON MAXIMAL 8, MINDESTENS 2.400 LV
290399-         '-EINHEITEN UND 30 EINHEITEN IM UNFALL-               '.
290399     05  FILLER.
290399         10 FILLER              PIC S9(004) COMP   VALUE  23.
290399         10 FILLER              PIC  X(002)        VALUE 'SF'.
290399         10 FILLER              PIC S9(004) COMP   VALUE   1.
290399         10 FILLER              PIC S9(004) COMP   VALUE   3.
290399         10 FILLER              PIC S9(004) COMP   VALUE   0.
290399         10 FILLER              PIC  X(132)        VALUE
290399                         '      GESCHÄFT ERZIELT HABEN (NETTO-EINH
290399-         'EITEN EIGENNEUG.).                                   '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'SF'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
290399*120199  10 FILLER              PIC S9(004) COMP   VALUE   1.
290399         10 FILLER              PIC S9(004) COMP   VALUE   4.
290399*120199  10 FILLER              PIC S9(004) COMP   VALUE   1.
290399         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(001)      VALUE     X'AC'.
120199         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
120199         10 FILLER              PIC  X(001)      VALUE     X'BC'.
120199         10 FILLER              PIC  X(050)        VALUE SPACE.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'SF'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
290399*120199  10 FILLER              PIC S9(004) COMP   VALUE   2.
290399         10 FILLER              PIC S9(004) COMP   VALUE   5.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(001)      VALUE     X'FA'.
120199         10 FILLER              PIC  X(080)        VALUE
120199                          ' STAND ABRECHNUNG: 01/1999 - #DSTAT#
120199-                 '                              SEITE: #S# '.
120199         10 FILLER              PIC  X(001)      VALUE     X'FA'.
120199         10 FILLER              PIC  X(050)        VALUE SPACE.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'SF'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
290399*120199  10 FILLER              PIC S9(004) COMP   VALUE   3.
290399         10 FILLER              PIC S9(004) COMP   VALUE   6.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(001)      VALUE     X'AB'.
120199         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
120199         10 FILLER              PIC  X(001)      VALUE     X'BB'.
120199         10 FILLER              PIC  X(050)        VALUE SPACE.
120199
120199*    * LISTE 23/ GRUPPENKOPF 1: GEWINNER
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'GK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         'GEWINNER: "JAHRTAUSENDWETTBEWERB"
120199-                        '
120199-          '                                                    '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'GK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '_________
120199-                        '
120199-          '                                                    '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'GK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   3.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '
120199-                        '
120199-          '                                                    '.
120199
290399*    * LISTE 23/ GRUPPFENFUß 1:
290399*    05  FILLER.
290399*        10 FILLER              PIC S9(004) COMP   VALUE  23.
290399*        10 FILLER              PIC  X(002)        VALUE 'GF'.
290399*        10 FILLER              PIC S9(004) COMP   VALUE   1.
290399*        10 FILLER              PIC S9(004) COMP   VALUE   1.
290399*        10 FILLER              PIC S9(004) COMP   VALUE   1.
290399*        10 FILLER              PIC  X(132)        VALUE
290399*                        'ANM.: DER WETTBEWERB KANN NUR VON VERMÖG
290399*         'ENSBERATERN GEWONNEN WERDEN, DIE EINEN EQF           '.
290399*    05  FILLER.
290399*        10 FILLER              PIC S9(004) COMP   VALUE  23.
290399*        10 FILLER              PIC  X(002)        VALUE 'GF'.
290399*        10 FILLER              PIC S9(004) COMP   VALUE   1.
290399*        10 FILLER              PIC S9(004) COMP   VALUE   2.
290399*        10 FILLER              PIC S9(004) COMP   VALUE   0.
290399*        10 FILLER              PIC  X(132)        VALUE
290399*                        '      VON MAXIMAL 8, MINDESTENS 2.400 LV
290399*         '-EINHEITEN UND 30 EINHEITEN IM UNFALL-               '.
290399*    05  FILLER.
290399*        10 FILLER              PIC S9(004) COMP   VALUE  23.
290399*        10 FILLER              PIC  X(002)        VALUE 'GF'.
290399*        10 FILLER              PIC S9(004) COMP   VALUE   1.
290399*        10 FILLER              PIC S9(004) COMP   VALUE   3.
290399*        10 FILLER              PIC S9(004) COMP   VALUE   0.
290399*        10 FILLER              PIC  X(132)        VALUE
290399*                        '      GESCHÄFT ERZIELT HABEN (NETTO-EINH
290399*         'EITEN EIGENNEUG.).                                   '.
120199
120199*    * LISTE 23/ GRUPPENKOPF 2: ANWÄRTER
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'GK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         'ANWÄRTER:
120199-                        '
120199-          '                                                    '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'GK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '_________
120199-                        '
120199-          '                                                    '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'GK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   3.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '
120199-                        '
120199-          '                                                    '.
120199*    * LISTE 23/ SPALTENKOPF 1:
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'PK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         'RANG DIR VB-NR   NAME            STUFE
120199-         '            NETTO-EINH. EIGEN NEUG.                  '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'PK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '
120199-         '          LV-GESCHÄFT            UV-GESCHÄFT         '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'PK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   3.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '                                       V
120199-         'ORMONATE   LFD. MONAT   GESAMT                       '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'PK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   4.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '
120199-         '                                                     '.
120199*    * LISTE 23/ SPALTENKOPF 2:
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'PK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         'RANG DIR VB-NR   NAME            STUFE
120199-         '            NETTO-EINH. EIGEN NEUG.                  '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'PK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '
120199-         '          LV-GESCHÄFT            UV-GESCHÄFT         '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'PK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   3.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '                                       V
120199-         'ORMONATE   LFD. MONAT   GESAMT                       '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  23.
120199         10 FILLER              PIC  X(002)        VALUE 'PK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   4.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '
120199-         '                                                     '.

120199*----------------------------------------------------------------*
120199*    * LISTE 24: ZIELWETTBEWERB 99   RGS - D
120199*----------------------------------------------------------------*
120199*    * LISTE 24: SEITENKOPF-ZEILEN
120199
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'SK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   3.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '
120199-                 '                                           '.
120199
120199*    * LISTE 24: SEITENFUSS-ZEILEN
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'SF'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC  X(001)      VALUE     X'AC'.
120199         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
120199         10 FILLER              PIC  X(001)      VALUE     X'BC'.
120199         10 FILLER              PIC  X(050)        VALUE SPACE.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'SF'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(001)      VALUE     X'FA'.
120199         10 FILLER              PIC  X(080)        VALUE
120199                          ' STAND ABRECHNUNG: 01 - #DSTAT#
120199-                 '                              SEITE: #S# '.
120199         10 FILLER              PIC  X(001)      VALUE     X'FA'.
120199         10 FILLER              PIC  X(050)        VALUE SPACE.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'SF'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   3.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(001)      VALUE     X'AB'.
120199         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
120199         10 FILLER              PIC  X(001)      VALUE     X'BB'.
120199         10 FILLER              PIC  X(050)        VALUE SPACE.
120199
120199*    * LISTE 24/ GRUPPENKOPF 1: GEWINNER
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'GK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         'GEWINNER: "JAHRTAUSENDWETTBEWERB"
120199-                        '
120199-          '                                                    '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'GK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '_________
120199-                        '
120199-          '                                                    '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'GK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   3.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '
120199-                        '
120199-          '                                                    '.
120199
120199*    * LISTE 24/ GRUPPENKOPF 2: ANWÄRTER
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'GK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         'ANWÄRTER:
120199-                        '
120199-          '                                                    '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'GK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '_________
120199-                        '
120199-          '                                                    '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'GK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   3.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '
120199-                        '
120199-          '                                                    '.
120199*    * LISTE 24/ SPALTENKOPF 1:
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'PK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         'RANG DIR VB-NR   NAME            VORNAME
120199-                 '   EINH. NEUE VB    UMSATZ- ZIELERREICH.   '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'PK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '
120199-                 '                       ZIEL   IN %         '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'PK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   3.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '
120199-                 '                                           '.
120199*    * LISTE 24/ SPALTENKOPF 2:
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'PK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   1.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         'RANG DIR VB-NR   NAME            VORNAME
120199-                 '   EINH. NEUE VB    UMSATZ- ZIELERREICH.   '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'PK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '
120199-                 '                       ZIEL   IN %         '.
120199     05  FILLER.
120199         10 FILLER              PIC S9(004) COMP   VALUE  24.
120199         10 FILLER              PIC  X(002)        VALUE 'PK'.
120199         10 FILLER              PIC S9(004) COMP   VALUE   2.
120199         10 FILLER              PIC S9(004) COMP   VALUE   3.
120199         10 FILLER              PIC S9(004) COMP   VALUE   0.
120199         10 FILLER              PIC  X(132)        VALUE
120199                         '
120199-                 '                                           '.

090200*----------------------------------------------------------------*
090200*    * LISTE 25: WETTBEWERB 2000 LEISTUNGEN IM EIGENUMSATZ
090200*----------------------------------------------------------------*
090200*    * LISTE 25: SEITENKOPF-ZEILEN
090200
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'SK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   3.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '
090200-                 '                                           '.
090200
090200*    * LISTE 25: SEITENFUSS-ZEILEN
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'SF'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         'ANM.: DER WETTBEWERB KANN NUR VON VERMÖG
090200-         'ENSBERATERN GEWONNEN WERDEN, DIE EINEN EQF           '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'SF'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '      VON MAXIMAL 8, MINDESTENS 2.400 LV
090200-         '-EINHEITEN UND 30 EINHEITEN IM UNFALL-               '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'SF'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   3.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '      GESCHÄFT ERZIELT HABEN (NETTO-EINH
090200-         'EITEN EIGENNEUG.).                                   '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'SF'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   4.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(001)      VALUE     X'AC'.
090200         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
090200         10 FILLER              PIC  X(001)      VALUE     X'BC'.
090200         10 FILLER              PIC  X(050)        VALUE SPACE.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'SF'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   5.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(001)      VALUE     X'FA'.
090200         10 FILLER              PIC  X(080)        VALUE
090200                          ' STAND ABRECHNUNG: 01/2000 - #DSTAT#
090200-                 '                              SEITE: #S# '.
090200         10 FILLER              PIC  X(001)      VALUE     X'FA'.
090200         10 FILLER              PIC  X(050)        VALUE SPACE.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'SF'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   6.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(001)      VALUE     X'AB'.
090200         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
090200         10 FILLER              PIC  X(001)      VALUE     X'BB'.
090200         10 FILLER              PIC  X(050)        VALUE SPACE.
090200
090200*    * LISTE 25/ GRUPPENKOPF 1: GEWINNER
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'GK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         'GEWINNER: "LEISTUNGEN IM EIGENUMSATZ"
090200-                        '
090200-          '                                                    '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'GK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '_________
090200-                        '
090200-          '                                                    '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'GK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   3.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '
090200-                        '
090200-          '                                                    '.
090200
090200*    * LISTE 25/ GRUPPENKOPF 2: ANWÄRTER
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'GK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         'ANWÄRTER:
090200-                        '
090200-          '                                                    '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'GK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '_________
090200-                        '
090200-          '                                                    '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'GK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   3.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '
090200-                        '
090200-          '                                                    '.
090200*    * LISTE 25/ SPALTENKOPF 1:
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         'RANG DIR VB-NR   NAME            STUFE
090200-         '         KUM. NETTO-EINH. EIGEN NEUG.                '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '                                      LV
090200-         '-GESCHÄFT  ÜBRIGES   WERTUNGS-   UV-GESCHÄFT         '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   3.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '                                     (X
090200-         'FAKTOR 2)  GESCHÄFT  EINHEITEN   (MIND. 30E)         '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   4.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '
090200-         '                                                     '.
090200*    * LISTE 25/ SPALTENKOPF 2:
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         'RANG DIR VB-NR   NAME            STUFE
090200-         '         KUM. NETTO-EINH. EIGEN NEUG.                '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '                                      LV
090200-         '-GESCHÄFT  ÜBRIGES   WERTUNGS-   UV-GESCHÄFT         '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   3.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '                                     (X
090200-         'FAKTOR 2)  GESCHÄFT  EINHEITEN   (MIND. 30E)         '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  25.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   4.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '
090200-         '                                                     '.

090200*----------------------------------------------------------------*
090200*    * LISTE 26: WETTBEWERB 2000 - GRUPPENUMSATZ AL-D
090200*----------------------------------------------------------------*
090200*    * LISTE 26: SEITENKOPF-ZEILEN
090200
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'SK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   3.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '
090200-                 '                                           '.
090200
090200*    * LISTE 26: SEITENFUSS-ZEILEN
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'SF'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC  X(001)      VALUE     X'AC'.
090200         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
090200         10 FILLER              PIC  X(001)      VALUE     X'BC'.
090200         10 FILLER              PIC  X(050)        VALUE SPACE.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'SF'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(001)      VALUE     X'FA'.
090200         10 FILLER              PIC  X(080)        VALUE
090200                          ' STAND ABRECHNUNG: 01 - #DSTAT#
090200-                 '                              SEITE: #S# '.
090200         10 FILLER              PIC  X(001)      VALUE     X'FA'.
090200         10 FILLER              PIC  X(050)        VALUE SPACE.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'SF'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   3.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(001)      VALUE     X'AB'.
090200         10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
090200         10 FILLER              PIC  X(001)      VALUE     X'BB'.
090200         10 FILLER              PIC  X(050)        VALUE SPACE.
090200
090200*    * LISTE 26/ GRUPPENKOPF 1: GEWINNER
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'GK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         'GEWINNER: "FÖRDERUNG NEUER VB"
090200-                        '
090200-          '                                                    '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'GK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '_________
090200-                        '
090200-          '                                                    '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'GK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   3.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '
090200-                        '
090200-          '                                                    '.
090200
090200*    * LISTE 26/ GRUPPENKOPF 2: ANWÄRTER
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'GK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         'ANWÄRTER:
090200-                        '
090200-          '                                                    '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'GK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '_________
090200-                        '
090200-          '                                                    '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'GK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   3.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '
090200-                        '
090200-          '                                                    '.
090200*    * LISTE 26/ SPALTENKOPF 1:
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         'RANG DIR VB-NR   NAME            VORNAME
090200-                 '        E DURCH     E DURCH   WERTUNGS-    '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '
090200-                 '        NEUE VB     NEUE VB   EINHEITEN    '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   3.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '
090200-                 '    07/98-09/99 AB10/99(*2)                '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   4.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '
090200-                 '                                           '.
090200*    * LISTE 26/ SPALTENKOPF 2:
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   1.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         'RANG DIR VB-NR   NAME            VORNAME
090200-                 '        E DURCH     E DURCH   WERTUNGS-    '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '
090200-                 '        NEUE VB     NEUE VB   EINHEITEN    '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   3.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '
090200-                 '    07/98-09/99 AB10/99(*2)                '.
090200     05  FILLER.
090200         10 FILLER              PIC S9(004) COMP   VALUE  26.
090200         10 FILLER              PIC  X(002)        VALUE 'PK'.
090200         10 FILLER              PIC S9(004) COMP   VALUE   2.
090200         10 FILLER              PIC S9(004) COMP   VALUE   4.
090200         10 FILLER              PIC S9(004) COMP   VALUE   0.
090200         10 FILLER              PIC  X(132)        VALUE
090200                         '
090200-                 '                                           '.

120900*----------------------------------------------------------------*
      *    * LISTE 27: WETTBEWERB 2000 LEISTUNGEN IM EIGENUMSATZ
      *----------------------------------------------------------------*
      *    * LISTE 27: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 27: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'ANM.: DER WETTBEWERB KANN NUR VON VERMÖG
      -         'ENSBERATERN GEWONNEN WERDEN, DIE EINEN EQF           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '      VON MAXIMAL 8, MINDESTENS 2.400 LV
      -         '-EINHEITEN UND 30 EINHEITEN IM UNFALL-               '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '      GESCHÄFT ERZIELT HABEN (NETTO-EINH
      -         'EITEN EIGENNEUG.).                                   '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '      (* = DIE ERFORDERLICHEN MINDESTEIN
      -         'HEITEN WURDEN IM AKTUELLEN MONATSDURCHSCHNITT        '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '      NICHT ERREICHT!)                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   6.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(050)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   7.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(080)        VALUE
                                ' STAND ABRECHNUNG: 01/2000 - #DSTAT#
      -                 '                              SEITE: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(050)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   8.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(080)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(050)        VALUE SPACE.

      *    * LISTE 27/ GRUPPENKOPF 1: GEWINNER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINNER: "LEISTUNGEN IM EIGENUMSATZ"
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 27/ GRUPPENKOPF 2: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'ANWÄRTER:
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.
      *    * LISTE 27/ SPALTENKOPF 1:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR   NAME            STUFE
      -         '         KUM. NETTO-EINH. EIGEN NEUG.                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '                                      LV
      -         '-GESCHÄFT  ÜBRIGES   WERTUNGS-   UV-GESCHÄFT         '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '                                     (X
      -         'FAKTOR 2)  GESCHÄFT  EINHEITEN   (MIND. 30E)         '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -         '                                                     '.
      *    * LISTE 27/ SPALTENKOPF 2:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR   NAME            STUFE
      -         '         KUM. NETTO-EINH. EIGEN NEUG.                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '                                      LV
      -         '-GESCHÄFT  ÜBRIGES   WERTUNGS-   UV-GESCHÄFT         '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '                                     (X
      -         'FAKTOR 2)  GESCHÄFT  EINHEITEN   (MIND. 30E)         '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  27.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
120900-         '                                                     '.

140301*----------------------------------------------------------------*
      *      LISTE 28: LP UND WBW 2001 - PRAXISSTUFE                   *
      *      MIT 18 LISTENEINTRÄGEN                                    *
      *----------------------------------------------------------------*
      *    * LISTE 28: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 28: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(086)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(044)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(086)        VALUE
                                ' STAND ABRECHNUNG: #DDDDDDDD##DSTAT#
      -                 '                                  SEITE: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(044)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(086)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(044)        VALUE SPACE.

      *    * LISTE 28/ GRUPPENKOPF 1: GEWINNER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINNER: "ERFOLGE IM PRAXISAUFBAU"
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 28/ GRUPPENKOPF 2: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'ANWÄRTER:
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.
      *    * LISTE 28/ SPALTENKOPF 1 GEWINNER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR   NAME            VORNAME
      -        '      E          E                    WERTUNGS-  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '      EIGEN-     EIGEN-               EINHEITEN  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '      GESAMT     NEU                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '                                                    '.
      *    * LISTE 28/ SPALTENKOPF 2 ANWÄRTER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR   NAME            VORNAME
      -        '      E          E                    WERTUNGS-  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '      EIGEN-     EIGEN-               EINHEITEN  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '      GESAMT     NEU                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  28.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '                                                    '.
140301*---------------ENDE LISTE 28 -----------------------------------*

140301*----------------------------------------------------------------*
      *      LISTE 29: LP UND WBW 2001 STUFEN RGS - D                  *
      *      MIT 18 LISTENEINTRÄGEN                                    *
      *----------------------------------------------------------------*
      *    * LISTE 29: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 29: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(086)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(044)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(086)        VALUE
                                ' STAND ABRECHNUNG: #DDDDDDDD##DSTAT#
      -                 '                                  SEITE: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(044)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(086)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(044)        VALUE SPACE.

      *    * LISTE 29/ GRUPPENKOPF 1: GEWINNER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINNER: "ERFOLGE IM GRUPPENAUFBAU"
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 29/ GRUPPENKOPF 2: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'ANWÄRTER:
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.
      *    * LISTE 29/ SPALTENKOPF 1 GEWINNER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR   NAME            VORNAME
      -        '      E          E DURCH    E DURCH   WERTUNGS-  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '      GRUPPE-    NEUE VB    NEUE VB   EINHEITEN  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '      GESAMT     (OLZ2      (OLZ3                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '                 ERFÜLLT)   ERFÜLLT)                '.
      *    * LISTE 29/ SPALTENKOPF 2 ANWÄRTER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR   NAME            VORNAME
      -        '      E          E DURCH    E DURCH   WERTUNGS-  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '      GRUPPE-    NEUE VB    NEUE VB   EINHEITEN  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '      GESAMT     (OLZ2      (OLZ3                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  29.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '                 ERFÜLLT)   ERFÜLLT)                '.
140301*------------------ENDE LISTE 29 --------------------------------*


140301*----------------------------------------------------------------*
      *      LISTE 30: LP UND WBW 2001 STUFE AL                        *
      *      MIT 18 LISTENEINTRÄGEN                                    *
      *----------------------------------------------------------------*
      *    * LISTE 30: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 30: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(086)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(044)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(086)        VALUE
                                ' STAND ABRECHNUNG: #DDDDDDDD##DSTAT#
      -                 '                                  SEITE: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(044)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(086)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(044)        VALUE SPACE.

      *    * LISTE 30/ GRUPPENKOPF 1: GEWINNER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINNER: "ERFOLGE IM GRUPPENAUFBAU"
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 30/ GRUPPENKOPF 2: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'ANWÄRTER:
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.
      *    * LISTE 30/ SPALTENKOPF 1 GEWINNER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR   NAME            VORNAME
      -        '                                     EINHEITEN- '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '                                      GESAMT     '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '                                                   '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '                                                    '.
      *    * LISTE 30/ SPALTENKOPF 2 ANWÄRTER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR   NAME            VORNAME
      -        '                                     EINHEITEN- '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '                                      GESAMT     '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '                                                   '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  30.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '                                                    '.
140301*---------------ENDE LISTE 30 -----------------------------------*

170403*----------------------------------------------------------------*
      *      LISTE 31: LP2003                                          *
      *      MIT 18 LISTENEINTRÄGEN                                    *
      *----------------------------------------------------------------*
      *    * LISTE 31: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 31: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(086)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(044)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(086)        VALUE
                                ' STAND ABRECHNUNG: #DDDDDDDD##DSTAT#
      -                 '                                  SEITE: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(044)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(086)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(044)        VALUE SPACE.

      *    * LISTE 31/ GRUPPENKOPF 1: GEWINNER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'GEWINNER: "ERFOLGE IM GRUPPENAUFBAU"
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 31/ GRUPPENKOPF 2: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'ANWÄRTER:
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.
      *    * LISTE 31/ SPALTENKOPF 1 GEWINNER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR   NAME            VORNAME
      -        '      E          E          GEWERTETE WERTUNGS-  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '      BASIS-     STEIGER.-  STEIGER.- EINHEITEN  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '      ZEITRAUM   ZEITRAUM   EINH.                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '                                                    '.
      *    * LISTE 31/ SPALTENKOPF 2 ANWÄRTER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR   NAME            VORNAME
      -        '      E          E          GEWERTETE WERTUNGS-  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '      BASIS-     STEIGER.-  STEIGER.- EINHEITEN  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '      ZEITRAUM   ZEITRAUM   EINH.                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  31.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -        '                                                    '.
140301*------------------ENDE LISTE 31 --------------------------------*

041203*----------------------------------------------------------------*
      *      LISTE 32: LP2004 LISTEN FÜR GRUPPENAUFBAU U. EIGENGESCHÄFT*
      *      MIT 18 LISTENEINTRÄGEN                                    *
      *----------------------------------------------------------------*
      *    * LISTE 32: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 32: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(109)        VALUE
                                ' Stand Abrechnung: #DDDDDDDD##DSTAT#
      -                                         '
      -                 '                                  Seite: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(021)        VALUE SPACE.

      *    * LISTE 32/ GRUPPENKOPF 1: GEWINNER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Gewinner: "Erfolge im #GRUPPEEIGEN#"
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 32/ GRUPPENKOPF 2: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Anwärter:
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.
      *    * LISTE 32/ SPALTENKOPF 1 GEWINNER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang Dir VB-Nr   Name            Vorname
      -              '    VB-  #EHZEILE1# Einheiten Einheiten Einheiten
      -        ' Gewertete  Wertungs-                 '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '    Stf. Gesamt-    Basis-    Steiger.- #EHZEILE3#
      -        ' Einheiten  Einheiten                 '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '         Einheiten  Zeitraum  Zeitraum  #EHZEILE4#
      -        ' #FAKTOR2##                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '         11/02-
      -        ' #FAKTOR3##                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '         10/03
      -        ' #FAKTOR4##                           '.
      *    * LISTE 32/ SPALTENKOPF 2 ANWÄRTER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang Dir VB-Nr   Name            Vorname
      -              '    VB-  #EHZEILE1# Einheiten Einheiten Einheiten
      -        ' Gewertete  Wertungs-                 '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '    Stf. Gesamt-    Basis-    Steiger.- #EHZEILE3#
      -        ' Einheiten  Einheiten                 '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '         Einheiten  Zeitraum  Zeitraum  #EHZEILE4#
      -        ' #FAKTOR2##                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '         11/02-
      -        ' #FAKTOR3##                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  32.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '         10/03
      -        ' #FAKTOR4##                           '.
041203*------------------ENDE LISTE 32 --------------------------------*
041203*----------------------------------------------------------------*
      *      LISTE 33: LP2004                                          *
      *      MOTIVATIONSLISTEN FÜR GRUPPENAUFBAU U. EIGENGESCHÄFT      *
      *      MIT 18 LISTENEINTRÄGEN                                    *
      *      FÜR DIESE LISTE EXISTIEREN NUR ANWÄRTER UND KEINE GEWINNER*
      *----------------------------------------------------------------*
      *    * LISTE 33: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  33.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 33: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  33.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  33.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(109)        VALUE
                                ' Stand Abrechnung: #DDDDDDDD##DSTAT#
      -                                         '
      -                 '                                  Seite: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  33.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(021)        VALUE SPACE.

      *    * LISTE 33/ GRUPPENKOPF 1: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  33.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Anwärter: Motivationsliste #GRUPPEEIGEN#
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  33.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  33.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 33/ GRUPPENKOPF 2: ANWÄRTER
      *    05  FILLER.
      *        10 FILLER              PIC S9(004) COMP   VALUE  33.
      *        10 FILLER              PIC  X(002)        VALUE 'GK'.
      *        10 FILLER              PIC S9(004) COMP   VALUE   2.
      *        10 FILLER              PIC S9(004) COMP   VALUE   1.
      *        10 FILLER              PIC S9(004) COMP   VALUE   1.
      *        10 FILLER              PIC  X(132)        VALUE
      *                        'MOTIVATIONSLISTE #GRUPPEEIGEN#
      *-                       '
      *-         '                                                    '.
      *    05  FILLER.
      *        10 FILLER              PIC S9(004) COMP   VALUE  33.
      *        10 FILLER              PIC  X(002)        VALUE 'GK'.
      *        10 FILLER              PIC S9(004) COMP   VALUE   2.
      *        10 FILLER              PIC S9(004) COMP   VALUE   2.
      *        10 FILLER              PIC S9(004) COMP   VALUE   0.
      *        10 FILLER              PIC  X(132)        VALUE
      *                        '_________
      *-                       '
      *-         '                                                    '.
      *    05  FILLER.
      *        10 FILLER              PIC S9(004) COMP   VALUE  33.
      *        10 FILLER              PIC  X(002)        VALUE 'GK'.
      *        10 FILLER              PIC S9(004) COMP   VALUE   2.
      *        10 FILLER              PIC S9(004) COMP   VALUE   3.
      *        10 FILLER              PIC S9(004) COMP   VALUE   0.
      *        10 FILLER              PIC  X(132)        VALUE
      *                        '
      *-                       '
      *-         '                                                    '.
      *    * LISTE 33/ SPALTENKOPF 1 GEWINNER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  33.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '     Dir VB-Nr   Name            Vorname
      -               '   VB-  #EHZEILE1# Einheiten Einheiten Einheiten
      -        ' Gewertete  Wertungs-                 '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  33.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '   Stf. Gesamt-    Basis-    Steiger.- #EHZEILE3#
      -        ' Einheiten  Einheiten                 '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  33.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '        Einheiten  Zeitraum  Zeitraum  #EHZEILE4#
      -        ' #FAKTOR2##                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  33.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '        11/02
      -        ' #FAKTOR3##                           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  33.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '        10/03
      -        ' #FAKTOR4##                           '.
      *    * LISTE 33/ SPALTENKOPF 2 ANWÄRTER:
      *    05  FILLER.
      *        10 FILLER              PIC S9(004) COMP   VALUE  33.
      *        10 FILLER              PIC  X(002)        VALUE 'PK'.
      *        10 FILLER              PIC S9(004) COMP   VALUE   2.
      *        10 FILLER              PIC S9(004) COMP   VALUE   1.
      *        10 FILLER              PIC S9(004) COMP   VALUE   0.
      *        10 FILLER              PIC  X(132)        VALUE
      *                             'DIR VB-NR   NAME            VORNAME
      *-         '    VB-   GESAMT-    EINHEITEN  EINHEITEN  EINHEITEN
      *-       'EINHEITEN  WERTUNGS-                       '.
      *    05  FILLER.
      *        10 FILLER              PIC S9(004) COMP   VALUE  33.
      *        10 FILLER              PIC  X(002)        VALUE 'PK'.
      *        10 FILLER              PIC S9(004) COMP   VALUE   2.
      *        10 FILLER              PIC S9(004) COMP   VALUE   2.
      *        10 FILLER              PIC S9(004) COMP   VALUE   0.
      *        10 FILLER              PIC  X(132)        VALUE
      *                             '
      *-         '    STF.  EINHEITEN  BASIS-     STEIGER.-  #EHZEILE2#
      *-       '#FAKTOR2## EINHEITEN                       '.
      *    05  FILLER.
      *        10 FILLER              PIC S9(004) COMP   VALUE  33.
      *        10 FILLER              PIC  X(002)        VALUE 'PK'.
      *        10 FILLER              PIC S9(004) COMP   VALUE   2.
      *        10 FILLER              PIC S9(004) COMP   VALUE   3.
      *        10 FILLER              PIC S9(004) COMP   VALUE   0.
      *        10 FILLER              PIC  X(132)        VALUE
      *                             '
      *-         '          11/02-     ZEITRAUM   ZEITRAUM   #EHZEILE3#
      *-       '#FAKTOR3##                                 '.
      *    05  FILLER.
      *        10 FILLER              PIC S9(004) COMP   VALUE  33.
      *        10 FILLER              PIC  X(002)        VALUE 'PK'.
      *        10 FILLER              PIC S9(004) COMP   VALUE   2.
      *        10 FILLER              PIC S9(004) COMP   VALUE   4.
      *        10 FILLER              PIC S9(004) COMP   VALUE   0.
      *        10 FILLER              PIC  X(132)        VALUE
      *                             '
      *-         '          10/03
      *-       '#FAKTOR4##                                 '.
041203*------------------ENDE LISTE 33 --------------------------------*
041203*----------------------------------------------------------------*
      *      LISTE 34: LP2004 LISTEN FÜR ERFOLGE NEUE AGENTURLEITER    *
      *      MIT 18 LISTENEINTRÄGEN                                    *
      *----------------------------------------------------------------*
      *    * LISTE 34: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 34: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(109)        VALUE
                                ' Stand Abrechnung: #DDDDDDDD##DSTAT#
      -                                         '
      -                 '                                  Seite: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(021)        VALUE SPACE.

      *    * LISTE 34/ GRUPPENKOPF 1: GEWINNER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Gewinner: "Erfolge neue Agenturleiter"
      -                        '
      -          '                                                  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 34/ GRUPPENKOPF 2: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Anwärter:
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.
      *    * LISTE 34/ SPALTENKOPF 1 GEWINNER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang Dir VB-Nr   Name            Vorname
      -              '   VB-
      -        '            Einheiten                     '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '   Stf.
      -        '            Netto-                        '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '
      -        '            Eigen-                        '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '
      -        '            Gesamt                        '.
      *    * LISTE 34/ SPALTENKOPF 2 ANWÄRTER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang Dir VB-Nr   Name            Vorname
      -              '   VB-
      -        '            Einheiten                     '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '   Stf.
      -        '            Netto-                        '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '
      -        '            Eigen-                        '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  34.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '
      -        '            Gesamt                        '.
041203*------------------ENDE LISTE 34 --------------------------------*
060104*----------------------------------------------------------------*
      *      LISTE 35: LP2004 LISTEN FÜR ERFOLGE NEUE AGENTURLEITER    *
      *      OHNE STUFENANZEIGE -> IDENTISCH ZU LISTE 34 BIS AUF STUFE *
      *      MIT 18 LISTENEINTRÄGEN                                    *
      *----------------------------------------------------------------*
      *    * LISTE 35: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 35: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(109)        VALUE
                                ' STAND ABRECHNUNG: #DDDDDDDD##DSTAT#
      -                                         '
      -                 '                                  SEITE: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(021)        VALUE SPACE.

      *    * LISTE 35/ GRUPPENKOPF 1: GEWINNER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Gewinner: "Erfolge neue Agenturleiter"
      -                        '
      -          '                                                  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 35/ GRUPPENKOPF 2: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Anwärter:
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.
      *    * LISTE 35/ SPALTENKOPF 1 GEWINNER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR   NAME            VORNAME
      -              '
      -        '            EINHEITEN                     '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '
      -        '            NETTO-                        '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '
      -        '            EIGEN-                        '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '
      -        '            GESAMT                        '.
      *    * LISTE 35/ SPALTENKOPF 2 ANWÄRTER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'RANG DIR VB-NR   NAME            VORNAME
      -              '
      -        '            EINHEITEN                     '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '
      -        '            NETTO-                        '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '
      -        '            EIGEN-                        '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  35.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '
      -        '            GESAMT                        '.
060104*------------------ENDE LISTE 35 --------------------------------*
030105*----------------------------------------------------------------*
      *      LISTE 36: JBW2005 LISTEN FÜR ERFOLGE GRUPPENAUFBAU        *
      *----------------------------------------------------------------*
      *    * LISTE 36: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 36: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(109)        VALUE
                                ' Stand Abrechnung: #DDDDDDDD##DSTAT#
      -                                         '
      -                 '                                  Seite: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(021)        VALUE SPACE.

      *    * LISTE 36/ GRUPPENKOPF 1: GEWINNER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Gewinner: "Erfolge im Gruppenaufbau"
      -                        '
      -          '                                                  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 36/ GRUPPENKOPF 2: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Anwärter:
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.
      *    * LISTE 36/ SPALTENKOPF 1 GEWINNER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang DIR VB-Nr   Name            Vorname
      -             '   VB-   Einheiten  Einheiten           Einheiten
      -        'Wertungs-    Steige-            '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '   Stf.  Basis-     Wettbew.-           aus neuen
      -        'Einheiten    rung               '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '         Zeitraum   Zeitraum            VB
      -        '                              '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '         01/04-     01/05-              x 3
      -        '                              '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '         #DATBAS#   #DATSTEI#
      -        '                              '.
      *    * LISTE 36/ SPALTENKOPF 2 ANWÄRTER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang DIR VB-Nr   Name            Vorname
      -             '   VB-   Einheiten  Einheiten           Einheiten
      -        'Wertungs-    Steige-            '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '   Stf.  Basis-     Wettbew.-           aus neuen
      -        'Einheiten    rung             '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '         Zeitraum   Zeitraum            VB
      -        '                              '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '         01/04-     01/05-              x 3
      -        '                              '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  36.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '         #DATBAS#   #DATSTEI#
      -        '                              '.
030105*------------------ENDE LISTE 36 --------------------------------*
030105*----------------------------------------------------------------*
      *      LISTE 37: JBW2005 LISTEN FÜR ERFOLGE EIGENGESCHÄFT        *
      *----------------------------------------------------------------*
      *    * LISTE 37: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 37: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(109)        VALUE
                                ' Stand Abrechnung: #DDDDDDDD##DSTAT#
      -                                         '
      -                 '                                  Seite: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(021)        VALUE SPACE.

      *    * LISTE 37/ GRUPPENKOPF 1: GEWINNER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Gewinner: "Erfolge im Eigengeschäft"
      -                        '
      -          '                                                  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 37/ GRUPPENKOPF 2: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Anwärter:
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.
      *    * LISTE 37/ SPALTENKOPF 1 GEWINNER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang DIR VB-Nr   Name            Vorname
      -             '   VB-   Einheiten  Einheiten Einheiten Einheiten
      -        'Wertungs-    Steige-            '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '   Stf.  Basis-     Wettbew.- Riester   Unfallneu
      -        'Einheiten    rung               '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '         Zeitraum   Zeitraum  Geschäft  Geschäft
      -        '                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '         01/04-     01/05-    x 3       x 10
      -        '                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '         #DATBAS#   #DATSTEI#
      -        '                                '.
      *    * LISTE 37/ SPALTENKOPF 2 ANWÄRTER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang DIR VB-Nr   Name            Vorname
      -             '   VB-   Einheiten  Einheiten Einheiten Einheiten
      -        'Wertungs-    Steige-            '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '   Stf.  Basis-     Wettbew.- Riester   Unfallneu
      -        'Einheiten    rung               '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '         Zeitraum   Zeitraum  Geschäft  Geschäft
      -        '                                         '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '         01/04-     01/05-    x 3       x 10
      -        '                                         '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  37.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '         #DATBAS#   #DATSTEI#
      -        '                                         '.
060104*------------------ENDE LISTE 37 --------------------------------*
030105*----------------------------------------------------------------*
      *      LISTE 38: JBW2005 LISTEN FÜR ERFOLGE NEUE AL              *
      *----------------------------------------------------------------*
      *    * LISTE 38: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 38: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(109)        VALUE
                                ' Stand Abrechnung: #DDDDDDDD##DSTAT#
      -                                         '
      -                 '                                  Seite: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(021)        VALUE SPACE.

      *    * LISTE 38/ GRUPPENKOPF 1: GEWINNER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Gewinner: "Erfolge Neue Agenturleiter
      -                        '
      -          '                                                  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 38/ GRUPPENKOPF 2: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Anwärter:
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.
      *    * LISTE 38/ SPALTENKOPF 1 GEWINNER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang DIR VB-Nr   Name            Vorname
      -              '   VB-   Einheiten  Einheiten Einheiten
      -        '            Wertungs-           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '   Stf.  Wettbew.-  Riester   Unfallneu-
      -        '            Einheiten           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '         Zeitraum   Geschäft  Geschäft
      -        '                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '         01/05-     x 3       x 10
      -        '                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '         #DATSTEI#
      -        '                                '.
      *    * LISTE 37/ SPALTENKOPF 2 ANWÄRTER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang DIR VB-Nr   Name            Vorname
      -              '   VB-   Einheiten  Einheiten Einheiten
      -        '            Wertungs-           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '   Stf.  Wettbew.-  Riester   Unfallneu-
      -        '            Einheiten           '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '         Zeitraum   Geschäft  Geschäft
      -        '                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '         01/05-     x 3       x 10
      -        '                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  38.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '         #DATSTEI#
      -        '                                '.
060104*------------------ENDE LISTE 38 --------------------------------*
090206*----------------------------------------------------------------*
      *      LISTE 39: JBW2006 LISTEN FÜR ERFOLGE GRUPPENAUFBAU        *
      *----------------------------------------------------------------*
      *    * LISTE 39: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 39: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(109)        VALUE
                                ' Stand Abrechnung: #DDDDDDDD##DSTAT#
      -                                         '
      -                 '                                  SEITE: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(021)        VALUE SPACE.

      *    * LISTE 39/ GRUPPENKOPF 1: GEWINNER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Gewinner: Erfolge im Gruppenaufbau
      -                        '
      -          '                                                  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 39/ GRUPPENKOPF 2: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Anwärter:
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.
      *    * LISTE 39/ SPALTENKOPF 1 GEWINNER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang Dir VB-Nr   Name            Vorname
      -             '    VB-        Einheiten       Einheiten       Einh
      -    'eiten'.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '   Stufe        Neue VB         Neue VB         Neu
      -    'e VB                                   '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '                direkt          indirekt      dir.
      -    '+ ind.                                   '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '              01/06-#DATSTEI# 01/06-#DATSTEI# 01/
      -        '06-#DATSTEI#                      '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '
      -        '                                   '.
      *    * LISTE 39/ SPALTENKOPF 2 ANWÄRTER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang Dir VB-Nr   Name            Vorname
      -             '    VB-        Einheiten       Einheiten       Einh
      -    'eiten'.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '   Stufe        Neue VB         Neue VB         Neu
      -    'e VB                                   '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '                direkt          indirekt      dir.
      -    '+ ind.                                   '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '              01/06-#DATSTEI# 01/06-#DATSTEI# 01/
      -        '06-#DATSTEI#                      '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  39.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -               '
      -        '                                   '.
090206*------------------ENDE LISTE 39 --------------------------------*
090206*----------------------------------------------------------------*
      *      LISTE 40: JBW2006 LISTEN FÜR ERFOLGE EIGENGESCHÄFT        *
      *----------------------------------------------------------------*
      *    * LISTE 40: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 40: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(109)        VALUE
                                ' Stand Abrechnung: #DDDDDDDD##DSTAT#
      -                                         '
      -                 '                                  SEITE: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(021)        VALUE SPACE.

      *    * LISTE 40/ GRUPPENKOPF 1: GEWINNER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Gewinner: Erfolge im Eigengeschäft
      -                        '
      -          '                                                  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 40/ GRUPPENKOPF 2: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Anwärter:
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.
      *    * LISTE 40/ SPALTENKOPF 1 GEWINNER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang Dir VB-Nr   Name            Vorname
      -             '    VB-       Einheiten      Einheiten     Einheite
      -        'n       Wertungs-                       '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '   Stufe      Wettbew.-      Riester       Unfallne
      -        'u-      Einheiten                       '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '              Zeitraum       Geschäft      Geschäft
      -        '                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '             01/06-#DATSTEI# x 3           x 10
      -        '                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '
      -        '                                '.
      *    * LISTE 40/ SPALTENKOPF 2 ANWÄRTER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang Dir VB-Nr   Name            Vorname
      -             '    VB-       Einheiten      Einheiten     Einheite
      -        'n       Wertungs-                       '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '   Stufe      Wettbew.-      Riester       Unfallne
      -        'u-      Einheiten                       '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '              Zeitraum       Geschäft      Geschäft
      -        '                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '             01/06-#DATSTEI# x 3           x 10
      -        '                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  40.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '
      -        '                                '.
090206*------------------ENDE LISTE 40 --------------------------------*
090206*----------------------------------------------------------------*
      *      LISTE 41: JBW2006 LISTEN FÜR ERFOLGE NEUE AL              *
      *----------------------------------------------------------------*
      *    * LISTE 41: SEITENKOPF-ZEILEN

           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'SK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                 '                                           '.

      *    * LISTE 40: SEITENFUSS-ZEILEN
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(001)      VALUE     X'AC'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BC'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(109)        VALUE
                                ' Stand Abrechnung: #DDDDDDDD##DSTAT#
      -                                         '
      -                 '                                  SEITE: #S# '.
               10 FILLER              PIC  X(001)      VALUE     X'FA'.
               10 FILLER              PIC  X(021)        VALUE SPACE.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'SF'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(001)      VALUE     X'AB'.
               10 FILLER              PIC  X(109)      VALUE ALL X'BF'.
               10 FILLER              PIC  X(001)      VALUE     X'BB'.
               10 FILLER              PIC  X(021)        VALUE SPACE.

      *    * LISTE 41/ GRUPPENKOPF 1: GEWINNER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Gewinner: Erfolge neue Agenturleiter
      -                        '
      -          '                                                  '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.

      *    * LISTE 40/ GRUPPENKOPF 2: ANWÄRTER
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC  X(132)        VALUE
                               'Anwärter:
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '_________
      -                        '
      -          '                                                    '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'GK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -                        '
      -          '                                                    '.
      *    * LISTE 41/ SPALTENKOPF 1 GEWINNER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang Dir VB-Nr   Name            Vorname
      -             '    VB-       Einheiten      Einheiten     Einheite
      -        'n       Wertungs-                       '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '   Stufe      Wettbew.-      Riester       Unfallne
      -        'u-      Einheiten                       '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '              Zeitraum       Geschäft      Geschäft
      -        '                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '             01/06-#DATSTEI# x 3           x 10
      -        '                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '
      -        '                                '.
      *    * LISTE 41/ SPALTENKOPF 2 ANWÄRTER:
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   1.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               'Rang Dir VB-Nr   Name            Vorname
      -             '    VB-       Einheiten      Einheiten     Einheite
      -        'n       Wertungs-                       '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '   Stufe      Wettbew.-      Riester       Unfallne
      -        'u-      Einheiten                       '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   3.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '              Zeitraum       Geschäft      Geschäft
      -        '                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   4.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -             '             01/06-#DATSTEI# x 3           x 10
      -        '                                '.
           05  FILLER.
               10 FILLER              PIC S9(004) COMP   VALUE  41.
               10 FILLER              PIC  X(002)        VALUE 'PK'.
               10 FILLER              PIC S9(004) COMP   VALUE   2.
               10 FILLER              PIC S9(004) COMP   VALUE   5.
               10 FILLER              PIC S9(004) COMP   VALUE   0.
               10 FILLER              PIC  X(132)        VALUE
                               '
      -              '
      -        '                                '.
090206*------------------ENDE LISTE 41 --------------------------------*

      *------------------------------------------------------------*
      *    REDEFINE ALS TABELLE (ANZAHL ZEILEN ENTSPR. OCCURS)     *
      *------------------------------------------------------------*
       01  FILLER REDEFINES T-LID.
170403*140301  05  T-LID-ZEILE OCCURS 674
041203*    05  T-LID-ZEILE OCCURS 692
041203*    05  T-LID-ZEILE OCCURS 739
060104*    05  T-LID-ZEILE OCCURS 742
030105*    05  T-LID-ZEILE OCCURS 760
030105*    05  T-LID-ZEILE OCCURS 820
030105     05  T-LID-ZEILE OCCURS 880
                            INDEXED BY I-LID.
               10 T-LID-LIST-ID       PIC S9(004) COMP.
               10 T-LID-DATEN-TYP     PIC  X(002).
               10 T-LID-TYP-LFD-NR    PIC S9(004) COMP.
               10 T-LID-TEXT-LFD-NR   PIC S9(004) COMP.
               10 T-LID-TEXT-FLEERZ   PIC S9(004) COMP.
               10 T-LID-TEXT          PIC  X(132).
      *
      ******** ENDE COPY-MEMBER (DRAT0069) ************

